# Welcome to this Kernel

* This kernel is a compilation of 75 exercises with solutions from this webpage:

https://www.machinelearningplus.com/python/101-pandas-exercises-python/

* If you want the compilation of 100 pandas tricks published by Kevin Markham weekly, follow this link:

https://www.kaggle.com/python10pm/pandas-100-tricks

* If you want to learn **Numpy** check this kernel with 70 exercises:

https://www.kaggle.com/python10pm/learn-numpy-the-hard-way-70-exercises-solutions

# Upvote if you found it useful

<a id='table_of_contents'></a>
# Table of contents

[1. How to import pandas and check the version?](#q1)

[2. How to create a series from a list, numpy array and dict?](#q2)

[3. How to convert the index of a series into a column of a dataframe?](#q3)

[4. How to combine many series to form a dataframe?](#q4)

[5. How to assign name to the series’ index?](#q5)

[6. How to get the items of series A not present in series B?](#q6)

[7. How to get the items not common to both series A and series B?](#q7)

[8. How to get the minimum, 25th percentile, median, 75th, and max of a numeric series?](#q8)

[9. How to get frequency counts of unique items of a series?](#q9)

[10. How to keep only top 2 most frequent values as it is and replace everything else as ‘Other’?](#q10)

[11. How to bin a numeric series to 10 groups of equal size?](#q11)

[12. How to convert a numpy array to a dataframe of given shape?](#q12)

[13. How to find the positions of numbers that are multiples of 3 from a series?](#q13)

[14. How to extract items at given positions from a series?](#q14)

[15. How to stack two series vertically and horizontally ?](#q15)

[16. How to get the positions of items of series A in another series B?](#q16)

[17. How to compute the mean squared error on a truth and predicted series?](#q17)

[18. How to convert the first character of each element in a series to uppercase?](#q18)

[19. How to calculate the number of characters in each word in a series?](#q19)

[20. How to compute difference of differences between consequtive numbers of a series?](#q20)

[21. How to convert a series of date-strings to a timeseries?](#q21)

[22. How to get the day of month, week number, day of year and day of week from a series of date strings?](#q22)

[23. How to convert year-month string to dates corresponding to the 4th day of the month?](#q23)

[24. How to filter words that contain atleast 2 vowels from a series?](#q24)

[25. How to filter valid emails from a series?](#q25)

[26. How to get the mean of a series grouped by another series?](#q26)

[27. How to compute the euclidean distance between two series?](#q27)

[28. How to find all the local maxima (or peaks) in a numeric series?](#q28)

[29. How to replace missing spaces in a string with the least frequent character?](#q29)

[30. How to create a TimeSeries starting ‘2000-01-01’ and 10 weekends (saturdays) after that having random numbers as values?](#q30)

[31. How to fill an intermittent time series so all missing dates show up with values of previous non-missing date?](#q31)

[32. How to compute the autocorrelations of a numeric series?](#q32)

[33. How to import only every nth row from a csv file to create a dataframe?](#q33)

[34. How to change column values when importing csv to a dataframe?](#q34)

[35. How to create a dataframe with rows as strides from a given series?](#q35)

[36. How to import only specified columns from a csv file?](#q36)

[37. How to get the nrows, ncolumns, datatype, summary stats of each column of a dataframe? Also get the array and list equivalent.](#q37)

[38. How to extract the row and column number of a particular cell with given criterion?](#q38)

[39. How to rename a specific columns in a dataframe?](#q39)

[40. How to check if a dataframe has any missing values?](#q40)

[41. How to count the number of missing values in each column?](#q41)

[42. How to replace missing values of multiple numeric columns with the mean?](#q42)

[43. How to use apply function on existing columns with global variables as additional arguments?](#q43)

[44. How to select a specific column from a dataframe as a dataframe instead of a series?](#q44)

[45. How to change the order of columns of a dataframe?](#q45)

[46. How to set the number of rows and columns displayed in the output?](#q46)

[47. How to format or suppress scientific notations in a pandas dataframe?](#q47)

[48. How to format all the values in a dataframe as percentages?](#q48)

[49. How to filter every nth row in a dataframe?](#q49)

[50. How to create a primary key index by combining relevant columns?](#q50)

[51. How to get the row number of the nth largest value in a column?](#q51)

[52. How to find the position of the nth largest value greater than a given value?](#q52)

[53. How to get the last n rows of a dataframe with row sum > 100?](#q53)

[54. How to find and cap outliers from a series or dataframe column?](#q54)

[55. How to reshape a dataframe to the largest possible square after removing the negative values?](#q55)

[56. How to swap two rows of a dataframe?](#q56)

[57. How to reverse the rows of a dataframe?](#q57)

[58. How to create one-hot encodings of a categorical variable (dummy variables)?](#q58)

[59. Which column contains the highest number of row-wise maximum values?](#q59)

[60. How to create a new column that contains the row number of nearest column by euclidean distance?](#q60)

[61. How to know the maximum possible correlation value of each column against other columns?](#q61)

[62. How to create a column containing the minimum by maximum of each row?](#q62)

[63. How to create a column that contains the penultimate value in each row?](#q63)

[64. How to normalize all columns in a dataframe?](#q64)

[65. How to compute the correlation of each row with the suceeding row?](#q65)

[66. How to replace both the diagonals of dataframe with 0?](#q66)

[67. How to get the particular group of a groupby dataframe by key?](#q67)

[68. How to get the n’th largest value of a column when grouped by another column?](#q68)

[69. How to compute grouped mean on pandas dataframe and keep the grouped column as another column (not index)?](#q69)

[70. How to join two dataframes by 2 columns so they have only the common rows?](#q70)

[71. How to remove rows from a dataframe that are present in another dataframe?](#q71)

[72. How to get the positions where values of two columns match?](#q72)

[73. How to create lags and leads of a column in a dataframe?](#q73)

[74. How to get the frequency of unique values in the entire dataframe?](#q74)

[75. How to split a text column into two separate columns?](#q75)

In [1]:
# Allow several prints in one cell
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

# Pandas exercise

<a id='q1'></a>
**1. How to import pandas and check the version?**

[Go back to the table of contents](#table_of_contents)

In [2]:
import pandas as pd
print(pd.__version__)

# Print all pandas dependencies
print(pd.show_versions(as_json=True))

0.25.3
{'system': {'commit': None, 'python': '3.6.6.final.0', 'python-bits': 64, 'OS': 'Linux', 'OS-release': '4.19.79+', 'machine': 'x86_64', 'processor': '', 'byteorder': 'little', 'LC_ALL': 'C.UTF-8', 'LANG': 'C.UTF-8', 'LOCALE': 'en_US.UTF-8'}, 'dependencies': {'pandas': '0.25.3', 'numpy': '1.17.4', 'pytz': '2019.3', 'dateutil': '2.8.0', 'pip': '19.3.1', 'setuptools': '42.0.1.post20191125', 'Cython': '0.29.14', 'pytest': '5.0.1', 'hypothesis': '4.50.6', 'sphinx': '2.2.1', 'blosc': None, 'feather': '0.4.0', 'xlsxwriter': '1.2.6', 'lxml.etree': '4.4.1', 'html5lib': '1.0.1', 'pymysql': None, 'psycopg2': None, 'jinja2': '2.10.3', 'IPython': '7.9.0', 'pandas_datareader': '0.8.1', 'bs4': '4.8.1', 'bottleneck': '1.3.1', 'fastparquet': None, 'gcsfs': None, 'matplotlib': '3.0.3', 'numexpr': '2.6.9', 'odfpy': None, 'openpyxl': '3.0.1', 'pandas_gbq': None, 'pyarrow': '0.15.1', 'pytables': None, 's3fs': '0.4.0', 'scipy': '1.3.3', 'sqlalchemy': '1.3.11', 'tables': '3.5.1', 'xarray': '0.14.1', 'xlrd': '1.2.0', 'xlwt': '1.3.0'}}
None

<a id = 'q2'></a>

**2. How to create a series from a list, numpy array and dict?**

Create a pandas series from each of the items below: a list, numpy and a dictionary

[Go back to the table of contents](#table_of_contents)

In [3]:
# Input
import numpy as np
a_list = list("abcdefg")
numpy_array = np.arange(1, 10)
dictionary = {"A":  0, "B":1, "C":2, "D":3, "E":5}

In [4]:
series1 = pd.Series(a_list)
print(series1)
series2 = pd.Series(numpy_array)
print(series2)
series3 = pd.Series(dictionary)
print(series3)

0    a
1    b
2    c
3    d
4    e
5    f
6    g
dtype: object
0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64
A    0
B    1
C    2
D    3
E    5
dtype: int64

<a id = 'q3'></a>
**3. How to convert the index of a series into a column of a dataframe?**

Convert the series ser into a dataframe with its index as another column on the dataframe.

[Go back to the table of contents](#table_of_contents)

In [5]:
# input
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))
ser = pd.Series(mydict)
print(ser[:5])

a    0
b    1
c    2
e    3
d    4
dtype: int64

In [6]:
# solution 1 using DataFrame
ser_df = pd.DataFrame(ser)
ser_df.reset_index()

# using pandas to_frame()
ser_df = ser.to_frame().reset_index()
ser_df

   index   0
0      a   0
1      b   1
2      c   2
3      e   3
4      d   4
5      f   5
6      g   6
7      h   7
8      i   8
9      j   9
10     k  10
11     l  11
12     m  12
13     n  13
14     o  14
15     p  15
16     q  16
17     r  17
18     s  18
19     t  19
20     u  20
21     v  21
22     w  22
23     x  23
24     y  24
25     z  25

   index   0
0      a   0
1      b   1
2      c   2
3      e   3
4      d   4
5      f   5
6      g   6
7      h   7
8      i   8
9      j   9
10     k  10
11     l  11
12     m  12
13     n  13
14     o  14
15     p  15
16     q  16
17     r  17
18     s  18
19     t  19
20     u  20
21     v  21
22     w  22
23     x  23
24     y  24
25     z  25

<a id = 'q4'></a>
**4. How to combine many series to form a dataframe?**

Combine ser1 and ser2 to form a dataframe.

[Go back to the table of contents](#table_of_contents)

In [7]:
# input
ser1 = pd.Series(list('abcedfghijklmnopqrstuvwxyz'))
ser2 = pd.Series(np.arange(26))

In [8]:
# using pandas DataFrame
ser_df = pd.DataFrame(ser1, ser2).reset_index()
ser_df.head()
# using pandas DataFrame with a dictionary, gives a specific name to the column
ser_df = pd.DataFrame({"col1":ser1, "col2":ser2})
ser_df.head(5)
# using pandas concat
ser_df = pd.concat([ser1, ser2], axis = 1)
ser_df.head()

   index  0
0      0  a
1      1  b
2      2  c
3      3  e
4      4  d

  col1  col2
0    a     0
1    b     1
2    c     2
3    e     3
4    d     4

   0  1
0  a  0
1  b  1
2  c  2
3  e  3
4  d  4

<a id = 'q5'></a>
**5. How to assign name to the series’ index?**

Give a name to the series ser calling it ‘alphabets’.

[Go back to the table of contents](#table_of_contents)

In [9]:
# input
ser = pd.Series(list('abcedfghijklmnopqrstuvwxyz'))

In [10]:
# using series rename method
ser.rename("alphabets")
# using series attribute
ser.name = "other_name"
ser

0     a
1     b
2     c
3     e
4     d
5     f
6     g
7     h
8     i
9     j
10    k
11    l
12    m
13    n
14    o
15    p
16    q
17    r
18    s
19    t
20    u
21    v
22    w
23    x
24    y
25    z
Name: alphabets, dtype: object

0     a
1     b
2     c
3     e
4     d
5     f
6     g
7     h
8     i
9     j
10    k
11    l
12    m
13    n
14    o
15    p
16    q
17    r
18    s
19    t
20    u
21    v
22    w
23    x
24    y
25    z
Name: other_name, dtype: object

<a id = 'q6'></a>
**6. How to get the items of series A not present in series B?**

Get all items of ser1 and ser2 not common to both.

[Go back to the table of contents](#table_of_contents)

In [11]:
# input
ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8])

In [12]:
ser1[~ser1.isin(ser2)]

0    1
1    2
2    3
dtype: int64

<a id = 'q7'></a>
**7. How to get the items not common to both series A and series B?**

Get all items of ser1 and ser2 not common to both.

[Go back to the table of contents](#table_of_contents)

In [13]:
# input
ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8])

In [14]:
# using pandas
a_not_b = ser1[~ser1.isin(ser2)]
b_not_a = ser2[~ser2.isin(ser1)]
                          
a_not_b.append(b_not_a, ignore_index = True)

# using numpy union and intersection
ser_u = pd.Series(np.union1d(ser1, ser2))
ser_i = pd.Series(np.intersect1d(ser1, ser2))
ser_u[~ser_u.isin(ser_i)]

0    1
1    2
2    3
3    6
4    7
5    8
dtype: int64

0    1
1    2
2    3
5    6
6    7
7    8
dtype: int64

<a id = 'q8'></a>
**8. How to get the minimum, 25th percentile, median, 75th, and max of a numeric series?**

Compute the minimum, 25th percentile, median, 75th, and maximum of ser.

[Go back to the table of contents](#table_of_contents)

In [15]:
# input
state = np.random.RandomState(100)
ser = pd.Series(state.normal(10, 5, 25))

In [16]:
# using pandas
ser.describe()

# or using numpy
np.percentile(ser, q = [0, 25, 50, 75, 100])

count    25.000000
mean     10.435437
std       4.253118
min       1.251173
25%       7.709865
50%      10.922593
75%      13.363604
max      18.094908
dtype: float64

array([ 1.25117263,  7.70986507, 10.92259345, 13.36360403, 18.0949083 ])

<a id = 'q9'></a>
**9. How to get frequency counts of unique items of a series?**

Calculate the frequency counts of each unique value ser.

[Go back to the table of contents](#table_of_contents)

In [17]:
# input
ser = pd.Series(np.take(list('abcdefgh'), np.random.randint(8, size=30)))

In [18]:
ser.value_counts()

h    7
b    6
d    4
a    4
f    3
c    3
g    2
e    1
dtype: int64

<a id = 'q10'></a>
**10. How to keep only top 2 most frequent values as it is and replace everything else as ‘Other’?**

From ser, keep the top 2 most frequent items as it is and replace everything else as ‘Other’.

[Go back to the table of contents](#table_of_contents)

In [19]:
# input
np.random.RandomState(100)
ser = pd.Series(np.random.randint(1, 5, [12]))
ser

RandomState(MT19937) at 0x7FF13ADF5468

0     3
1     4
2     1
3     3
4     4
5     1
6     2
7     1
8     3
9     2
10    3
11    4
dtype: int64

In [20]:
ser.value_counts()
ser[~ser.isin(ser.value_counts().index[:2])] = 'Other'
ser
# we do value_counts to see the repetitions for each value, then we do ~ser.isin value_counts, filter by index the first 2 and = "Other renames the values"

3    4
4    3
1    3
2    2
dtype: int64

0         3
1         4
2     Other
3         3
4         4
5     Other
6     Other
7     Other
8         3
9     Other
10        3
11        4
dtype: object

<a id = 'q11'></a>
**11. How to bin a numeric series to 10 groups of equal size?**

Bin the series ser into 10 equal deciles and replace the values with the bin name.

[Go back to the table of contents](#table_of_contents)

In [21]:
# input
ser = pd.Series(np.random.random(20))
ser

0     0.922563
1     0.080714
2     0.165445
3     0.744861
4     0.697445
5     0.505623
6     0.480408
7     0.462540
8     0.083057
9     0.157972
10    0.231042
11    0.822674
12    0.375716
13    0.085806
14    0.932795
15    0.898751
16    0.576770
17    0.567353
18    0.421083
19    0.606595
dtype: float64

In [22]:
pd.qcut(ser, q = 10)
# we can also pass labels
pd.qcut(ser, q = [0, .10, .20, .30, .40, .50, .60, .70, .80, .90, 1], labels=['1st', '2nd', '3rd', '4th', '5th', '6th', '7th', '8th', '9th', '10th']).head()

0       (0.901, 0.933]
1     (0.0797, 0.0855]
2       (0.164, 0.332]
3        (0.634, 0.76]
4        (0.634, 0.76]
5       (0.493, 0.571]
6       (0.446, 0.493]
7       (0.446, 0.493]
8     (0.0797, 0.0855]
9      (0.0855, 0.164]
10      (0.164, 0.332]
11       (0.76, 0.901]
12      (0.332, 0.446]
13     (0.0855, 0.164]
14      (0.901, 0.933]
15       (0.76, 0.901]
16      (0.571, 0.634]
17      (0.493, 0.571]
18      (0.332, 0.446]
19      (0.571, 0.634]
dtype: category
Categories (10, interval[float64]): [(0.0797, 0.0855] < (0.0855, 0.164] < (0.164, 0.332] < (0.332, 0.446] ... (0.571, 0.634] < (0.634, 0.76] < (0.76, 0.901] < (0.901, 0.933]]

0    10th
1     1st
2     3rd
3     8th
4     8th
dtype: category
Categories (10, object): [1st < 2nd < 3rd < 4th ... 7th < 8th < 9th < 10th]

<a id = 'q12'></a>
**12. How to convert a numpy array to a dataframe of given shape? (L1)**

Reshape the series ser into a dataframe with 7 rows and 5 columns

[Go back to the table of contents](#table_of_contents)

In [23]:
# input
ser = pd.Series(np.random.randint(1, 10, 35))
ser

0     2
1     6
2     6
3     6
4     4
5     5
6     7
7     7
8     1
9     4
10    6
11    2
12    7
13    9
14    4
15    6
16    5
17    1
18    3
19    8
20    4
21    7
22    4
23    9
24    7
25    9
26    1
27    8
28    1
29    9
30    2
31    9
32    8
33    9
34    1
dtype: int64

In [24]:
# using numpy
pd.DataFrame(np.array(ser).reshape(7, 5))

# using only pandas
pd.DataFrame(ser.values.reshape(7, 5))

   0  1  2  3  4
0  2  6  6  6  4
1  5  7  7  1  4
2  6  2  7  9  4
3  6  5  1  3  8
4  4  7  4  9  7
5  9  1  8  1  9
6  2  9  8  9  1

   0  1  2  3  4
0  2  6  6  6  4
1  5  7  7  1  4
2  6  2  7  9  4
3  6  5  1  3  8
4  4  7  4  9  7
5  9  1  8  1  9
6  2  9  8  9  1

<a id = 'q13'></a>
**13. How to find the positions of numbers that are multiples of 3 from a series?**

Find the positions of numbers that are multiples of 3 from ser.

[Go back to the table of contents](#table_of_contents)

In [25]:
# input

np.random.RandomState(100)
ser = pd.Series(np.random.randint(1, 5, 10))
ser

RandomState(MT19937) at 0x7FF13ADF5468

0    2
1    4
2    1
3    3
4    4
5    2
6    4
7    3
8    3
9    2
dtype: int64

In [26]:
# using the where clause
ser.where(lambda x: x%3 == 0).dropna()

# using numpy and reshape to get a pandas series
#pd.Series(np.argwhere(ser%3 == 0).reshape(4))
np.argwhere(ser%3 == 0)

3    3.0
7    3.0
8    3.0
dtype: float64

/opt/conda/lib/python3.6/site-packages/numpy/core/fromnumeric.py:61: FutureWarning: Series.nonzero() is deprecated and will be removed in a future version.Use Series.to_numpy().nonzero() instead
  return bound(*args, **kwds)

array([[3],
       [7],
       [8]])

<a id = 'q14'></a>
**14. How to extract items at given positions from a series**

From ser, extract the items at positions in list pos.

[Go back to the table of contents](#table_of_contents)

In [27]:
# input

ser = pd.Series(list('abcdefghijklmnopqrstuvwxyz'))
pos = [0, 4, 8, 14, 20]

In [28]:
# using loc
ser.loc[pos]

# using series take
ser.take(pos)

0     a
4     e
8     i
14    o
20    u
dtype: object

0     a
4     e
8     i
14    o
20    u
dtype: object

<a id = 'q15'></a>

**15. How to stack two series vertically and horizontally ?**

Stack ser1 and ser2 vertically and horizontally (to form a dataframe).

[Go back to the table of contents](#table_of_contents)

In [29]:
# input
ser1 = pd.Series(range(5))
ser2 = pd.Series(list('abcde'))

In [30]:
# vertical
ser1.append(ser2)
# or using pandas concat and axis = 0
pd.concat([ser1, ser2], axis = 0)

# horizontal
pd.concat([ser1, ser2], axis = 1)

0    0
1    1
2    2
3    3
4    4
0    a
1    b
2    c
3    d
4    e
dtype: object

0    0
1    1
2    2
3    3
4    4
0    a
1    b
2    c
3    d
4    e
dtype: object

   0  1
0  0  a
1  1  b
2  2  c
3  3  d
4  4  e

<a id = 'q16'></a>
**16. How to get the positions of items of series A in another series B?**

Get the positions of items of ser2 in ser1 as a list.

[Go back to the table of contents](#table_of_contents)

In [31]:
# input
ser1 = pd.Series([10, 9, 6, 5, 3, 1, 12, 8, 13])
ser2 = pd.Series([1, 3, 10, 13])

In [32]:
# get's the index, but it's sorts the index
list(ser1[ser1.isin(ser2)].index)

# using numpy where
[np.where(i == ser1)[0].tolist()[0] for i in ser2]

# using pandas Index and get location
[pd.Index(ser1).get_loc(i) for i in ser2]

[0, 4, 5, 8]

[5, 4, 0, 8]

[5, 4, 0, 8]

<a id = 'q17'></a>
**17. How to compute the mean squared error on a truth and predicted series?**

Compute the mean squared error of truth and pred series.

[Go back to the table of contents](#table_of_contents)

In [33]:
# input
truth = pd.Series(range(10))
pred = pd.Series(range(10)) + np.random.random(10)

In [34]:
# BAD, don't use it
(np.mean([(truth_i - pred_i)**2 for truth_i, pred_i in zip(truth, pred)]))

# using numpy
np.mean((truth-pred)**2)

# using sklear metrics
from sklearn.metrics import mean_squared_error
mean_squared_error(truth, pred)

0.43249243972562007

0.43249243972561996

0.43249243972562007

<a id = 'q18'></a>

**18. How to convert the first character of each element in a series to uppercase?**

Change the first character of each word to upper case in each word of ser.

[Go back to the table of contents](#table_of_contents)

In [35]:
# input
ser = pd.Series(['just', 'a', 'random', 'list'])
ser

0      just
1         a
2    random
3      list
dtype: object

In [36]:
# using python string method title() Assumes we only encounter string in the list
[i.title() for i in ser]

# using lambda
ser.map(lambda x: x.title())

# other solution
ser.map(lambda x: x[0].upper() + x[1:])

['Just', 'A', 'Random', 'List']

0      Just
1         A
2    Random
3      List
dtype: object

0      Just
1         A
2    Random
3      List
dtype: object

<a id = 'q19'></a>

**19. How to calculate the number of characters in each word in a series?**

[Go back to the table of contents](#table_of_contents)

In [37]:
# input
ser = pd.Series(['just', 'a', 'random', 'list'])

In [38]:
# using list comprehension
[len(i) for i in ser]

# using series map
ser.map(len)

# using series apply
ser.apply(len)

[4, 1, 6, 4]

0    4
1    1
2    6
3    4
dtype: int64

0    4
1    1
2    6
3    4
dtype: int64

<a id = 'q20'></a>
**20. How to compute difference of differences between consequtive numbers of a series?**

Difference of differences between the consequtive numbers of ser.

[Go back to the table of contents](#table_of_contents)

In [39]:
# input
ser = pd.Series([1, 3, 6, 10, 15, 21, 27, 35])

# Desired Output
# [nan, 2.0, 3.0, 4.0, 5.0, 6.0, 6.0, 8.0]
# [nan, nan, 1.0, 1.0, 1.0, 1.0, 0.0, 2.0]

In [40]:
# using pandas diff()
ser.diff(periods = 1).tolist()
ser.diff(periods = 1).diff(periods = 1).tolist()

[nan, 2.0, 3.0, 4.0, 5.0, 6.0, 6.0, 8.0]

[nan, nan, 1.0, 1.0, 1.0, 1.0, 0.0, 2.0]

<a id = 'q21'></a>

**21. How to convert a series of date-strings to a timeseries?**

[Go back to the table of contents](#table_of_contents)

In [41]:
# input
ser = pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])


'''
Desired Output

0   2010-01-01 00:00:00
1   2011-02-02 00:00:00
2   2012-03-03 00:00:00
3   2013-04-04 00:00:00
4   2014-05-05 00:00:00
5   2015-06-06 12:20:00
'''

'\nDesired Output\n\n0   2010-01-01 00:00:00\n1   2011-02-02 00:00:00\n2   2012-03-03 00:00:00\n3   2013-04-04 00:00:00\n4   2014-05-05 00:00:00\n5   2015-06-06 12:20:00\n'

In [42]:
# using pands to_datetime
pd.to_datetime(ser)

# using dateutil parse
from dateutil.parser import parse
ser.map(lambda x: parse(x))

0   2010-01-01 00:00:00
1   2011-02-02 00:00:00
2   2012-03-03 00:00:00
3   2013-04-04 00:00:00
4   2014-05-05 00:00:00
5   2015-06-06 12:20:00
dtype: datetime64[ns]

0   2010-01-01 00:00:00
1   2011-02-02 00:00:00
2   2012-03-03 00:00:00
3   2013-04-04 00:00:00
4   2014-05-05 00:00:00
5   2015-06-06 12:20:00
dtype: datetime64[ns]

<a id = 'q22'></a>
**22. How to get the day of month, week number, day of year and day of week from a series of date strings?**

Get the day of month, week number, day of year and day of week from ser.

[Go back to the table of contents](#table_of_contents)

In [43]:
# input
ser = pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])

'''
Desired output

Date:  [1, 2, 3, 4, 5, 6]
Week number:  [53, 5, 9, 14, 19, 23]
Day num of year:  [1, 33, 63, 94, 125, 157]
Day of week:  ['Friday', 'Wednesday', 'Saturday', 'Thursday', 'Monday', 'Saturday']
'''

"\nDesired output\n\nDate:  [1, 2, 3, 4, 5, 6]\nWeek number:  [53, 5, 9, 14, 19, 23]\nDay num of year:  [1, 33, 63, 94, 125, 157]\nDay of week:  ['Friday', 'Wednesday', 'Saturday', 'Thursday', 'Monday', 'Saturday']\n"

In [44]:
# day
pd.to_datetime(ser).dt.day.to_list()
# week
pd.to_datetime(ser).dt.week.to_list()
# another method
pd.to_datetime(ser).dt.weekofyear.to_list()
# day of year
pd.to_datetime(ser).dt.dayofyear.to_list()
# day of week in words
week_dict = {0:"Monday", 1:"Tuesday", 2:"Wednesday", 3:"Thursday", 4:"Friday", 5:"Saturday", 6:"Sunday"}
pd.to_datetime(ser).dt.dayofweek.map(week_dict).to_list()
# another method
pd.to_datetime(ser).dt.weekday_name.to_list()

[1, 2, 3, 4, 5, 6]

[53, 5, 9, 14, 19, 23]

[53, 5, 9, 14, 19, 23]

[1, 33, 63, 94, 125, 157]

['Friday', 'Wednesday', 'Saturday', 'Thursday', 'Monday', 'Saturday']

['Friday', 'Wednesday', 'Saturday', 'Thursday', 'Monday', 'Saturday']

<a id = 'q23'></a>

**23. How to convert year-month string to dates corresponding to the 4th day of the month?**

Change ser to dates that start with 4th of the respective months.

[Go back to the table of contents](#table_of_contents)

In [45]:
# input
ser = pd.Series(['Jan 2010', 'Feb 2011', 'Mar 2012'])

'''
Desired Output

0   2010-01-04
1   2011-02-04
2   2012-03-04
dtype: datetime64[ns]

'''

'\nDesired Output\n\n0   2010-01-04\n1   2011-02-04\n2   2012-03-04\ndtype: datetime64[ns]\n\n'

In [46]:
# solution using parser
from dateutil.parser import parse
ser.map(lambda x: parse('04 ' + x))

# another solution

from dateutil.parser import parse
# Parse the date
ser_ts = ser.map(lambda x: parse(x))

# Construct date string with date as 4
ser_datestr = ser_ts.dt.year.astype('str') + '-' + ser_ts.dt.month.astype('str') + '-' + '04'

# Format it.
[parse(i).strftime('%Y-%m-%d') for i in ser_datestr]

0   2010-01-04
1   2011-02-04
2   2012-03-04
dtype: datetime64[ns]

['2010-01-04', '2011-02-04', '2012-03-04']

<a id = 'q24'></a>

**24. How to filter words that contain atleast 2 vowels from a series?**

From ser, extract words that contain atleast 2 vowels.

[Go back to the table of contents](#table_of_contents)

In [47]:
# input
ser = pd.Series(['Apple', 'Orange', 'Plan', 'Python', 'Money'])

'''
Desired Output


0     Apple
1    Orange
4     Money
dtype: object
'''

'\nDesired Output\n\n\n0     Apple\n1    Orange\n4     Money\ndtype: object\n'

In [48]:
# using nested loops
vowels = list("aeiou")
list_ = []
for w in ser:
    c = 0
    for l in list(w.lower()):
        if l in vowels:
            c += 1
    if c >= 2:
        print(w)
        list_.append(w)

ser[ser.isin(list_)]

# another solution using counter

from collections import Counter
mask = ser.map(lambda x: sum([Counter(x.lower()).get(i, 0) for i in list('aeiou')]) >= 2)
ser[mask]

Apple
Orange
Money

0     Apple
1    Orange
4     Money
dtype: object

0     Apple
1    Orange
4     Money
dtype: object

<a id = 'q25'></a>

**25. How to filter valid emails from a series?**

Extract the valid emails from the series emails. The regex pattern for valid emails is provided as reference.

[Go back to the table of contents](#table_of_contents)

In [49]:
# input
emails = pd.Series(['buying books at amazom.com', 'rameses@egypt.com', 'matt@t.co', 'narendra@modi.com'])
pattern ='[A-Za-z0-9._%+-]+@[A-Za-z0-9.-]+\\.[A-Za-z]{2,4}'

'''
Desired Output

1    rameses@egypt.com
2            matt@t.co
3    narendra@modi.com
dtype: object
'''

'\nDesired Output\n\n1    rameses@egypt.com\n2            matt@t.co\n3    narendra@modi.com\ndtype: object\n'

In [50]:
# using powerful regex
import re
re_ = re.compile(pattern)
emails[emails.str.contains(pat = re_, regex = True)]

# other solutions
pattern ='[A-Za-z0-9._%+-]+@[A-Za-z0-9.-]+\\.[A-Za-z]{2,4}'
mask = emails.map(lambda x: bool(re.match(pattern, x)))
emails[mask]

# using str.findall
emails.str.findall(pattern, flags=re.IGNORECASE)

# using list comprehension
[x[0] for x in [re.findall(pattern, email) for email in emails] if len(x) > 0]

1    rameses@egypt.com
2            matt@t.co
3    narendra@modi.com
dtype: object

1    rameses@egypt.com
2            matt@t.co
3    narendra@modi.com
dtype: object

0                     []
1    [rameses@egypt.com]
2            [matt@t.co]
3    [narendra@modi.com]
dtype: object

['rameses@egypt.com', 'matt@t.co', 'narendra@modi.com']

<a id = 'q26'></a>

**26. How to get the mean of a series grouped by another series?**

Compute the mean of weights of each fruit.

[Go back to the table of contents](#table_of_contents)

In [51]:
# doesn't incluide the upper limit
fruit = pd.Series(np.random.choice(['apple', 'banana', 'carrot'], 10))
fruit
weights = pd.Series(np.linspace(1, 10, 10))
weights
#print(weights.tolist())
#print(fruit.tolist())

'''
Desired output

# values can change due to randomness
apple     6.0
banana    4.0
carrot    5.8
dtype: float64
'''

0    carrot
1     apple
2    banana
3    banana
4     apple
5     apple
6    banana
7     apple
8    carrot
9    carrot
dtype: object

0     1.0
1     2.0
2     3.0
3     4.0
4     5.0
5     6.0
6     7.0
7     8.0
8     9.0
9    10.0
dtype: float64

'\nDesired output\n\n# values can change due to randomness\napple     6.0\nbanana    4.0\ncarrot    5.8\ndtype: float64\n'

In [52]:
# using pandas groupby
df = pd.concat([fruit, weights], axis = 1)
df
df.groupby(0).mean()

# use one list to calculate a kpi from another
weights.groupby(fruit).mean()

        0     1
0  carrot   1.0
1   apple   2.0
2  banana   3.0
3  banana   4.0
4   apple   5.0
5   apple   6.0
6  banana   7.0
7   apple   8.0
8  carrot   9.0
9  carrot  10.0

               1
0
apple   5.250000
banana  4.666667
carrot  6.666667

apple     5.250000
banana    4.666667
carrot    6.666667
dtype: float64

<a id = 'q27'></a>

**27. How to compute the euclidean distance between two series?**

Compute the [euclidean distance](https://en.wikipedia.org/wiki/Euclidean_distance) between series (points) p and q, without using a packaged formula.

[Go back to the table of contents](#table_of_contents)

In [53]:
# Input
p = pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])
q = pd.Series([10, 9, 8, 7, 6, 5, 4, 3, 2, 1])
'''
Desired Output

18.165
'''

'\nDesired Output\n\n18.165\n'

In [54]:
# using list comprehension
suma = np.sqrt(np.sum([(p - q)**2 for p, q in zip(p, q)]))
suma

# using series one to one operation
sum((p - q)**2)**.5

# using numpy
np.linalg.norm(p-q)

18.16590212458495

18.16590212458495

18.16590212458495

<a id = 'q28'></a>

**28. How to find all the local maxima (or peaks) in a numeric series?**

[Go back to the table of contents](#table_of_contents)

In [55]:
# input
ser = pd.Series([2, 10, 3, 4, 9, 10, 2, 7, 3])

'''
Desired output

array([1, 5, 7])
'''

'\nDesired output\n\narray([1, 5, 7])\n'

In [56]:
# using pandas shift
local_max = ser[(ser.shift(1) < ser) & (ser.shift(-1) < ser)]
local_max.index

# using numpy
dd = np.diff(np.sign(np.diff(ser)))
dd
peak_locs = np.where(dd == -2)[0] + 1
peak_locs

Int64Index([1, 5, 7], dtype='int64')

array([-2,  2,  0,  0, -2,  2, -2])

array([1, 5, 7])

<a id = 'q29'></a>

**29. How to replace missing spaces in a string with the least frequent character?**

Replace the spaces in my_str with the least frequent character.

[Go back to the table of contents](#table_of_contents)

In [57]:
# input
my_str = 'dbc deb abed ggade'

'''
Desired Output

'dbccdebcabedcggade'  # least frequent is 'c'
'''

"\nDesired Output\n\n'dbccdebcabedcggade'  # least frequent is 'c'\n"

In [58]:
# using Counter
from collections import Counter
my_str_ = my_str
Counter_ = Counter(list(my_str_.replace(" ", "")))
Counter_
minimum = min(Counter_, key = Counter_.get)

print(my_str.replace(" ", minimum))

# using pandas
ser = pd.Series(list(my_str.replace(" ", "")))
ser.value_counts()
minimum = list(ser.value_counts().index)[-1]
minimum
print(my_str.replace(" ", minimum))

Counter({'d': 4, 'b': 3, 'c': 1, 'e': 3, 'a': 2, 'g': 2})

dbccdebcabedcggade

d    4
b    3
e    3
a    2
g    2
c    1
dtype: int64

'c'

dbccdebcabedcggade

<a id = 'q30'></a>

**30. How to create a TimeSeries starting ‘2000-01-01’ and 10 weekends (saturdays) after that having random numbers as values?**

[Go back to the table of contents](#table_of_contents)

In [59]:
'''
Desired Output
values can be random

2000-01-01    4
2000-01-08    1
2000-01-15    8
2000-01-22    4
2000-01-29    4
2000-02-05    2
2000-02-12    4
2000-02-19    9
2000-02-26    6
2000-03-04    6
'''

'\nDesired Output\nvalues can be random\n\n2000-01-01    4\n2000-01-08    1\n2000-01-15    8\n2000-01-22    4\n2000-01-29    4\n2000-02-05    2\n2000-02-12    4\n2000-02-19    9\n2000-02-26    6\n2000-03-04    6\n'

In [60]:
dti = pd.Series(pd.date_range('2000-01-01', periods=10, freq='W-SAT'))
random_num = pd.Series([np.random.randint(1, 10) for i in range(10)])


df = pd.concat({"Time":dti, "Numbers":random_num}, axis = 1)
df

# for more about time series functionality 
# https://pandas.pydata.org/pandas-docs/stable/user_guide/timeseries.html#timeseries-offset-aliases

# another solution just using pandas Series
ser = pd.Series(np.random.randint(1,10,10), pd.date_range('2000-01-01', periods=10, freq='W-SAT'))
ser

        Time  Numbers
0 2000-01-01        8
1 2000-01-08        3
2 2000-01-15        9
3 2000-01-22        9
4 2000-01-29        6
5 2000-02-05        8
6 2000-02-12        9
7 2000-02-19        6
8 2000-02-26        1
9 2000-03-04        1

2000-01-01    1
2000-01-08    5
2000-01-15    4
2000-01-22    8
2000-01-29    3
2000-02-05    9
2000-02-12    5
2000-02-19    1
2000-02-26    1
2000-03-04    8
Freq: W-SAT, dtype: int64

<a id = 'q31'></a>

**31. How to fill an intermittent time series so all missing dates show up with values of previous non-missing date?**

ser has missing dates and values. Make all missing dates appear and fill up with value from previous date.

[Go back to the table of contents](#table_of_contents)

In [61]:
# input
ser = pd.Series([1,10,3,np.nan], index=pd.to_datetime(['2000-01-01', '2000-01-03', '2000-01-06', '2000-01-08']))

'''
Desired Output

2000-01-01     1.0
2000-01-02     1.0
2000-01-03    10.0
2000-01-04    10.0
2000-01-05    10.0
2000-01-06     3.0
2000-01-07     3.0
2000-01-08     NaN
'''

'\nDesired Output\n\n2000-01-01     1.0\n2000-01-02     1.0\n2000-01-03    10.0\n2000-01-04    10.0\n2000-01-05    10.0\n2000-01-06     3.0\n2000-01-07     3.0\n2000-01-08     NaN\n'

In [62]:
# Solution 1
# first let's fill the missing dates
indx = pd.date_range("2000-01-01", "2000-01-08")
# now let's reindex the series ser with the new index
# we have to reasing back to ser
ser = ser.reindex(indx)
# lastly let's populate the missing values
ser.fillna(method = "ffill")

# Solution 2
ser = pd.Series([1,10,3,np.nan], index=pd.to_datetime(['2000-01-01', '2000-01-03', '2000-01-06', '2000-01-08']))
ser.resample('D').ffill()  # fill with previous value
ser.resample('D').bfill()  # fill with next value
ser.resample('D').bfill().ffill()  # fill next else prev value

2000-01-01     1.0
2000-01-02     1.0
2000-01-03    10.0
2000-01-04    10.0
2000-01-05    10.0
2000-01-06     3.0
2000-01-07     3.0
2000-01-08     3.0
Freq: D, dtype: float64

2000-01-01     1.0
2000-01-02     1.0
2000-01-03    10.0
2000-01-04    10.0
2000-01-05    10.0
2000-01-06     3.0
2000-01-07     3.0
2000-01-08     NaN
Freq: D, dtype: float64

2000-01-01     1.0
2000-01-02    10.0
2000-01-03    10.0
2000-01-04     3.0
2000-01-05     3.0
2000-01-06     3.0
2000-01-07     NaN
2000-01-08     NaN
Freq: D, dtype: float64

2000-01-01     1.0
2000-01-02    10.0
2000-01-03    10.0
2000-01-04     3.0
2000-01-05     3.0
2000-01-06     3.0
2000-01-07     3.0
2000-01-08     3.0
Freq: D, dtype: float64

<a id = 'q32'></a>

**32. How to compute the autocorrelations of a numeric series?**

Compute autocorrelations for the first 10 lags of ser. Find out which lag has the largest correlation.

[Go back to the table of contents](#table_of_contents)

In [63]:
# input
ser = pd.Series(np.arange(20) + np.random.normal(1, 10, 20))

'''
Desired Output

# values will change due to randomness
[0.29999999999999999, -0.11, -0.17000000000000001, 0.46000000000000002, 0.28000000000000003, -0.040000000000000001, -0.37, 0.41999999999999998, 0.47999999999999998, 0.17999999999999999]
Lag having highest correlation:  9
'''

'\nDesired Output\n\n# values will change due to randomness\n[0.29999999999999999, -0.11, -0.17000000000000001, 0.46000000000000002, 0.28000000000000003, -0.040000000000000001, -0.37, 0.41999999999999998, 0.47999999999999998, 0.17999999999999999]\nLag having highest correlation:  9\n'

In [64]:
# using pandas autocorr
# ser.autocorr(lag = 10)

# solution using list comprehension
autocorrelations = [ser.autocorr(i).round(2) for i in range(11)]
print(autocorrelations[1:])
print('Lag having highest correlation: ', np.argmax(np.abs(autocorrelations[1:]))+1)

[0.58, 0.34, 0.19, 0.11, 0.36, 0.49, 0.45, 0.38, 0.03, -0.18]
Lag having highest correlation:  1

<a id = 'q33'></a>

**33. How to import only every nth row from a csv file to create a dataframe?**

Import every 50th row of BostonHousing dataset as a dataframe.

[Go back to the table of contents](#table_of_contents)

In [65]:
# input
import os
for dirname, _, filenames in os.walk('/kaggle/input'):
    for filename in filenames:
        print(os.path.join(dirname, filename))

/kaggle/input/boston-house-prices/housing.csv
/kaggle/input/cars93/Cars93.csv

In [66]:
# data comes without headers, but we searched for it
names = ['CRIM', 'ZN', 'INDUS', 'CHAS', 'NOX', 'RM', 'AGE', 'DIS', 'RAD', 'TAX', 'PTRATIO', 'B', 'LSTAT', 'MEDV']

# pure Python implementation
with open("/kaggle/input/boston-house-prices/housing.csv") as f:
    data = f.read()
    nth_rows = []
    for i, rows in enumerate(data.split("\n")):
        if i%50 == 0:
            nth_rows.append(rows)
            
# nth_rows is a list of strings separated by blank spaces " "
# the next list comprehension will do the trick

nth_rows[0]
data_ = [nth_rows[i].split() for i in range(len(nth_rows))]
df = pd.DataFrame(data_, columns=names)
df

# other solutions

# Solution 2: Use chunks and for-loop
# df = pd.read_csv("/kaggle/input/boston-house-prices/housing.csv", chunksize=50)
# df2 = pd.DataFrame()
# for chunk in df:
#     df2 = df2.append(chunk.iloc[0,:])
# df2

# Solution 3: Use chunks and list comprehension
# df = pd.read_csv("/kaggle/input/boston-house-prices/housing.csv", chunksize=50)
# df2 = pd.concat([chunk.iloc[0] for chunk in df], axis=1)
# df2 = df2.transpose()
# df2

' 0.00632  18.00   2.310  0  0.5380  6.5750  65.20  4.0900   1  296.0  15.30 396.90   4.98  24.00'

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.00,2.310,0,0.5380,6.5750,65.20,4.0900,1,296.0,15.30,396.90,4.98,24.00
1,0.08873,21.00,5.640,0,0.4390,5.9630,45.70,6.8147,4,243.0,16.80,395.56,13.45,19.70
2,0.14866,0.00,8.560,0,0.5200,6.7270,79.90,2.7778,5,384.0,20.90,394.76,9.42,27.50
3,1.65660,0.00,19.580,0,0.8710,6.1220,97.30,1.6180,5,403.0,14.70,372.80,14.10,21.50
4,0.01778,95.00,1.470,0,0.4030,7.1350,13.90,7.6534,3,402.0,17.00,384.30,4.45,32.90
5,0.14030,22.00,5.860,0,0.4310,6.4870,13.00,7.3967,7,330.0,19.10,396.28,5.90,24.40
6,0.04417,70.00,2.240,0,0.4000,6.8710,47.40,7.8278,5,358.0,14.80,390.86,6.07,24.80
7,0.06211,40.00,1.250,0,0.4290,6.4900,44.40,8.7921,1,335.0,19.70,396.90,5.98,22.90
8,25.04610,0.00,18.100,0,0.6930,5.9870,100.00,1.5888,24,666.0,20.20,396.90,26.77,5.60
9,6.71772,0.00,18.100,0,0.7130,6.7490,92.60,2.3236,24,666.0,20.20,0.32,17.44,13.40
10,0.22438,0.00,9.690,0,0.5850,6.0270,79.70,2.4982,6,391.0,19.20,396.90,14.33,16.80

<a id = 'q34'></a>

**34. How to change column values when importing csv to a dataframe?**

Import the boston housing dataset, but while importing change the 'medv' (median house value) column so that values < 25 becomes ‘Low’ and > 25 becomes ‘High’.

[Go back to the table of contents](#table_of_contents)

In [67]:
# input
import os
for dirname, _, filenames in os.walk('/kaggle/input'):
    for filename in filenames:
        print(os.path.join(dirname, filename))

/kaggle/input/boston-house-prices/housing.csv
/kaggle/input/cars93/Cars93.csv

In [68]:
# first let's import using the previuos code and save as a normal csv

names = ['CRIM', 'ZN', 'INDUS', 'CHAS', 'NOX', 'RM', 'AGE', 'DIS', 'RAD', 'TAX', 'PTRATIO', 'B', 'LSTAT', 'MEDV']
with open("/kaggle/input/boston-house-prices/housing.csv") as f:
    data = f.read()
    nth_rows = []
    for i, rows in enumerate(data.split("\n")):
        nth_rows.append(rows)

data_ = [nth_rows[i].split() for i in range(len(nth_rows))]

df = pd.DataFrame(data_, columns=names)
df.head()
df.to_csv("housing_preprocessed.csv")
del df

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.00,2.310,0,0.5380,6.5750,65.20,4.0900,1,296.0,15.30,396.90,4.98,24.00
1,0.02731,0.00,7.070,0,0.4690,6.4210,78.90,4.9671,2,242.0,17.80,396.90,9.14,21.60
2,0.02729,0.00,7.070,0,0.4690,7.1850,61.10,4.9671,2,242.0,17.80,392.83,4.03,34.70
3,0.03237,0.00,2.180,0,0.4580,6.9980,45.80,6.0622,3,222.0,18.70,394.63,2.94,33.40
4,0.06905,0.00,2.180,0,0.4580,7.1470,54.20,6.0622,3,222.0,18.70,396.90,5.33,36.20

In [69]:
# now let's start importing as normal and use converters to convert the values
# skipfooter because we had the last rows with nan values and index_col to specify that the first column is the index
df = pd.read_csv("housing_preprocessed.csv",  index_col = 0, skipfooter=1,  converters = {"MEDV": lambda x: "HIGH" if float(x) >= 25 else "LOW"})
df

/opt/conda/lib/python3.6/site-packages/ipykernel_launcher.py:3: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support skipfooter; you can avoid this warning by specifying engine='python'.
  This is separate from the ipykernel package so we can avoid doing imports until

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,LOW
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,LOW
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,HIGH
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,HIGH
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,HIGH
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
501,0.06263,0.0,11.93,0,0.573,6.593,69.1,2.4786,1,273.0,21.0,391.99,9.67,LOW
502,0.04527,0.0,11.93,0,0.573,6.120,76.7,2.2875,1,273.0,21.0,396.90,9.08,LOW
503,0.06076,0.0,11.93,0,0.573,6.976,91.0,2.1675,1,273.0,21.0,396.90,5.64,LOW
504,0.10959,0.0,11.93,0,0.573,6.794,89.3,2.3889,1,273.0,21.0,393.45,6.48,LOW
505,0.04741,0.0,11.93,0,0.573,6.030,80.8,2.5050,1,273.0,21.0,396.90,7.88,LOW

<a id = 'q35'></a>

**35. How to create a dataframe with rows as strides from a given series?**

[Go back to the table of contents](#table_of_contents)

In [70]:
# input
L = pd.Series(range(15))

'''
Desired Output

array([[ 0,  1,  2,  3],
       [ 2,  3,  4,  5],
       [ 4,  5,  6,  7],
       [ 6,  7,  8,  9],
       [ 8,  9, 10, 11],
       [10, 11, 12, 13]])
'''

'\nDesired Output\n\narray([[ 0,  1,  2,  3],\n       [ 2,  3,  4,  5],\n       [ 4,  5,  6,  7],\n       [ 6,  7,  8,  9],\n       [ 8,  9, 10, 11],\n       [10, 11, 12, 13]])\n'

In [71]:
# using slicing
# let's generate a list of indexes we need to use
# outputs array([ 0,  2,  4,  6,  8, 10, 12, 14])
index_ = np.arange(0, 15, 2)
index_
my_list = []
for i in range(6):
    my_list.append(list(L[index_[i]:index_[i+2]]))
np.array(my_list)

# above code as list comprehension
np.array([L[index_[i]:index_[i+2]] for i in range(6)])

# another solution
def gen_strides(a, stride_len=5, window_len=5):
    n_strides = ((a.size-window_len)//stride_len) + 1
    return np.array([a[s:(s+window_len)] for s in np.arange(0, a.size, stride_len)[:n_strides]])

gen_strides(L, stride_len=2, window_len=4)

array([ 0,  2,  4,  6,  8, 10, 12, 14])

array([[ 0,  1,  2,  3],
       [ 2,  3,  4,  5],
       [ 4,  5,  6,  7],
       [ 6,  7,  8,  9],
       [ 8,  9, 10, 11],
       [10, 11, 12, 13]])

array([[ 0,  1,  2,  3],
       [ 2,  3,  4,  5],
       [ 4,  5,  6,  7],
       [ 6,  7,  8,  9],
       [ 8,  9, 10, 11],
       [10, 11, 12, 13]])

array([[ 0,  1,  2,  3],
       [ 2,  3,  4,  5],
       [ 4,  5,  6,  7],
       [ 6,  7,  8,  9],
       [ 8,  9, 10, 11],
       [10, 11, 12, 13]])

<a id = 'q36'></a>

**36. How to import only specified columns from a csv file?**

[Go back to the table of contents](#table_of_contents)

In [72]:
# input
        
# code that generates the housing_preprocessed.csv file
names = ['CRIM', 'ZN', 'INDUS', 'CHAS', 'NOX', 'RM', 'AGE', 'DIS', 'RAD', 'TAX', 'PTRATIO', 'B', 'LSTAT', 'MEDV']
with open("/kaggle/input/boston-house-prices/housing.csv") as f:
    data = f.read()
    nth_rows = []
    for i, rows in enumerate(data.split("\n")):
        nth_rows.append(rows)

data_ = [nth_rows[i].split() for i in range(len(nth_rows))]

df = pd.DataFrame(data_, columns=names)
df.to_csv("housing_preprocessed.csv")
del df

# use the /kaggle/input/boston-house-prices/housing_preprocessed.csv file
import os
for dirname, _, filenames in os.walk('/kaggle/input'):
    for filename in filenames:
        print(os.path.join(dirname, filename))

/kaggle/input/boston-house-prices/housing.csv
/kaggle/input/cars93/Cars93.csv

In [73]:
file = "housing_preprocessed.csv"
# using index
df = pd.read_csv(file, usecols = [1, 2, 4], skipfooter=1)
df.head()
# using column names
df = pd.read_csv(file, usecols = ["CRIM", "ZN", "CHAS"])
df.head()

/opt/conda/lib/python3.6/site-packages/ipykernel_launcher.py:3: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support skipfooter; you can avoid this warning by specifying engine='python'.
  This is separate from the ipykernel package so we can avoid doing imports until

      CRIM    ZN  CHAS
0  0.00632  18.0     0
1  0.02731   0.0     0
2  0.02729   0.0     0
3  0.03237   0.0     0
4  0.06905   0.0     0

      CRIM    ZN  CHAS
0  0.00632  18.0   0.0
1  0.02731   0.0   0.0
2  0.02729   0.0   0.0
3  0.03237   0.0   0.0
4  0.06905   0.0   0.0

<a id = 'q37'></a>

**37. How to get the nrows, ncolumns, datatype, summary stats of each column of a dataframe? Also get the array and list equivalent.**

[Go back to the table of contents](#table_of_contents)

In [74]:
# input
# use the "housing_preprocessed.csv" file

In [75]:
df = pd.read_csv("housing_preprocessed.csv", index_col=0 ,skipfooter=1)
# number of rows and columns
df.shape

# each type of column
df.dtypes

# a more general view of the earlier code
df.info()

# how many columns under each dtype
df.get_dtype_counts()
df.dtypes.value_counts()

# all the statistics
df.describe()

/opt/conda/lib/python3.6/site-packages/ipykernel_launcher.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support skipfooter; you can avoid this warning by specifying engine='python'.
  """Entry point for launching an IPython kernel.

(506, 14)

CRIM       float64
ZN         float64
INDUS      float64
CHAS         int64
NOX        float64
RM         float64
AGE        float64
DIS        float64
RAD          int64
TAX        float64
PTRATIO    float64
B          float64
LSTAT      float64
MEDV       float64
dtype: object

<class 'pandas.core.frame.DataFrame'>
Int64Index: 506 entries, 0 to 505
Data columns (total 14 columns):
CRIM       506 non-null float64
ZN         506 non-null float64
INDUS      506 non-null float64
CHAS       506 non-null int64
NOX        506 non-null float64
RM         506 non-null float64
AGE        506 non-null float64
DIS        506 non-null float64
RAD        506 non-null int64
TAX        506 non-null float64
PTRATIO    506 non-null float64
B          506 non-null float64
LSTAT      506 non-null float64
MEDV       506 non-null float64
dtypes: float64(12), int64(2)
memory usage: 59.3 KB

/opt/conda/lib/python3.6/site-packages/ipykernel_launcher.py:12: FutureWarning: `get_dtype_counts` has been deprecated and will be removed in a future version. For DataFrames use `.dtypes.value_counts()
  if sys.path[0] == '':

float64    12
int64       2
dtype: int64

float64    12
int64       2
dtype: int64

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
count,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000
mean,3.613524,11.363636,11.136779,0.069170,0.554695,6.284634,68.574901,3.795043,9.549407,408.237154,18.455534,356.674032,12.653063,22.532806
std,8.601545,23.322453,6.860353,0.253994,0.115878,0.702617,28.148861,2.105710,8.707259,168.537116,2.164946,91.294864,7.141062,9.197104
min,0.006320,0.000000,0.460000,0.000000,0.385000,3.561000,2.900000,1.129600,1.000000,187.000000,12.600000,0.320000,1.730000,5.000000
25%,0.082045,0.000000,5.190000,0.000000,0.449000,5.885500,45.025000,2.100175,4.000000,279.000000,17.400000,375.377500,6.950000,17.025000
50%,0.256510,0.000000,9.690000,0.000000,0.538000,6.208500,77.500000,3.207450,5.000000,330.000000,19.050000,391.440000,11.360000,21.200000
75%,3.677082,12.500000,18.100000,0.000000,0.624000,6.623500,94.075000,5.188425,24.000000,666.000000,20.200000,396.225000,16.955000,25.000000
max,88.976200,100.000000,27.740000,1.000000,0.871000,8.780000,100.000000,12.126500,24.000000,711.000000,22.000000,396.900000,37.970000,50.000000

<a id = 'q38'></a>

**38. How to extract the row and column number of a particular cell with given criterion?**

[Go back to the table of contents](#table_of_contents)

In [76]:
# input
# use the "housing_preprocessed.csv" file

In [77]:
# solution 1
df = pd.read_csv("housing_preprocessed.csv", skipfooter=1, index_col=0)
# let's get the maximum value
max_tax = df["TAX"].max()
max_tax

# now let's find the column and cell that has the maximum value
df[df["TAX"] == max_tax]

# solution 2
df.loc[df["TAX"] == np.max(df["TAX"]), ["CRIM", "ZN", "TAX"]]

# solution 3
# get the row and column number
row, col = np.where(df.values == np.max(df["TAX"]))
for i, j in zip(row, col):
    print(i , j)
    
# Get the value
df.iat[row[0], col[0]]
df.iloc[row[0], col[0]]

# Alternates
df.at[row[0], 'TAX']
df.get_value(row[0], 'TAX')

# The difference between `iat` - `iloc` vs `at` - `loc` is:
# `iat` snd `iloc` accepts row and column numbers. 
# Whereas `at` and `loc` accepts index and column names.

/opt/conda/lib/python3.6/site-packages/ipykernel_launcher.py:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support skipfooter; you can avoid this warning by specifying engine='python'.

711.0

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
488,0.15086,0.0,27.74,0,0.609,5.454,92.7,1.8209,4,711.0,20.1,395.09,18.06,15.2
489,0.18337,0.0,27.74,0,0.609,5.414,98.3,1.7554,4,711.0,20.1,344.05,23.97,7.0
490,0.20746,0.0,27.74,0,0.609,5.093,98.0,1.8226,4,711.0,20.1,318.43,29.68,8.1
491,0.10574,0.0,27.74,0,0.609,5.983,98.8,1.8681,4,711.0,20.1,390.11,18.07,13.6
492,0.11132,0.0,27.74,0,0.609,5.983,83.5,2.1099,4,711.0,20.1,396.90,13.35,20.1

        CRIM   ZN    TAX
488  0.15086  0.0  711.0
489  0.18337  0.0  711.0
490  0.20746  0.0  711.0
491  0.10574  0.0  711.0
492  0.11132  0.0  711.0

488 9
489 9
490 9
491 9
492 9

711.0

711.0

711.0

/opt/conda/lib/python3.6/site-packages/ipykernel_launcher.py:25: FutureWarning: get_value is deprecated and will be removed in a future release. Please use .at[] or .iat[] accessors instead

711.0

<a id = 'q39'></a>

**39. How to rename a specific columns in a dataframe?**

[Go back to the table of contents](#table_of_contents)

In [78]:
# input
# Rename the column Type as CarType in df and replace the ‘.’ in column names with ‘_’.
cars93 = pd.read_csv("../input/cars93/Cars93.csv", index_col=0)
cars93.head()

'''
Desired Output

Index(['Manufacturer', 'Model', 'CarType', 'Min_Price', 'Price', 'Max_Price',
        'MPG_city', 'MPG_highway', 'AirBags', 'DriveTrain', 'Cylinders',
        'EngineSize', 'Horsepower', 'RPM', 'Rev_per_mile', 'Man_trans_avail',
        'Fuel_tank_capacity', 'Passengers', 'Length', 'Wheelbase', 'Width',
        'Turn_circle', 'Rear_seat_room', 'Luggage_room', 'Weight', 'Origin',
        'Make'],
       dtype='object')
'''

,Manufacturer,Model,Type,Min.Price,Price,Max.Price,MPG.city,MPG.highway,AirBags,DriveTrain,...,Passengers,Length,Wheelbase,Width,Turn.circle,Rear.seat.room,Luggage.room,Weight,Origin,Make
1,Acura,Integra,Small,12.9,15.9,18.8,25,31,None,Front,...,5,177,102,68,37,26.5,11.0,2705,non-USA,Acura Integra
2,Acura,Legend,Midsize,29.2,33.9,38.7,18,25,Driver & Passenger,Front,...,5,195,115,71,38,30.0,15.0,3560,non-USA,Acura Legend
3,Audi,90,Compact,25.9,29.1,32.3,20,26,Driver only,Front,...,5,180,102,67,37,28.0,14.0,3375,non-USA,Audi 90
4,Audi,100,Midsize,30.8,37.7,44.6,19,26,Driver & Passenger,Front,...,6,193,106,70,37,31.0,17.0,3405,non-USA,Audi 100
5,BMW,535i,Midsize,23.7,30.0,36.2,22,30,Driver only,Rear,...,4,186,109,69,39,27.0,13.0,3640,non-USA,BMW 535i

"\nDesired Output\n\nIndex(['Manufacturer', 'Model', 'CarType', 'Min_Price', 'Price', 'Max_Price',\n        'MPG_city', 'MPG_highway', 'AirBags', 'DriveTrain', 'Cylinders',\n        'EngineSize', 'Horsepower', 'RPM', 'Rev_per_mile', 'Man_trans_avail',\n        'Fuel_tank_capacity', 'Passengers', 'Length', 'Wheelbase', 'Width',\n        'Turn_circle', 'Rear_seat_room', 'Luggage_room', 'Weight', 'Origin',\n        'Make'],\n       dtype='object')\n"

In [79]:
# Solution 1: in 2 steps
# Step1
# first let's rename the Type to CarType
cars93 = pd.read_csv("../input/cars93/Cars93.csv", index_col=0)
cars93.rename(columns={"Type":"CarType"}, inplace = True)
cols = cars93.columns
# or
df.columns.values[2] = "CarType"
# Step2
# replace the "." with "-"
cols = list(map(lambda x: x.replace(".", "_"), cols))
cars93.columns = cols
cars93.head()

# Solution 2: working only with lists
cars93 = pd.read_csv("../input/cars93/Cars93.csv", index_col=0)
cols = cars93.columns
cols = list(map(lambda x: x.replace(".", "_"), cols))
cols[cols.index("Type")] = "CarType"
cars93.columns = cols
cars93.head()

,Manufacturer,Model,CarType,Min_Price,Price,Max_Price,MPG_city,MPG_highway,AirBags,DriveTrain,...,Passengers,Length,Wheelbase,Width,Turn_circle,Rear_seat_room,Luggage_room,Weight,Origin,Make
1,Acura,Integra,Small,12.9,15.9,18.8,25,31,None,Front,...,5,177,102,68,37,26.5,11.0,2705,non-USA,Acura Integra
2,Acura,Legend,Midsize,29.2,33.9,38.7,18,25,Driver & Passenger,Front,...,5,195,115,71,38,30.0,15.0,3560,non-USA,Acura Legend
3,Audi,90,Compact,25.9,29.1,32.3,20,26,Driver only,Front,...,5,180,102,67,37,28.0,14.0,3375,non-USA,Audi 90
4,Audi,100,Midsize,30.8,37.7,44.6,19,26,Driver & Passenger,Front,...,6,193,106,70,37,31.0,17.0,3405,non-USA,Audi 100
5,BMW,535i,Midsize,23.7,30.0,36.2,22,30,Driver only,Rear,...,4,186,109,69,39,27.0,13.0,3640,non-USA,BMW 535i

,Manufacturer,Model,CarType,Min_Price,Price,Max_Price,MPG_city,MPG_highway,AirBags,DriveTrain,...,Passengers,Length,Wheelbase,Width,Turn_circle,Rear_seat_room,Luggage_room,Weight,Origin,Make
1,Acura,Integra,Small,12.9,15.9,18.8,25,31,None,Front,...,5,177,102,68,37,26.5,11.0,2705,non-USA,Acura Integra
2,Acura,Legend,Midsize,29.2,33.9,38.7,18,25,Driver & Passenger,Front,...,5,195,115,71,38,30.0,15.0,3560,non-USA,Acura Legend
3,Audi,90,Compact,25.9,29.1,32.3,20,26,Driver only,Front,...,5,180,102,67,37,28.0,14.0,3375,non-USA,Audi 90
4,Audi,100,Midsize,30.8,37.7,44.6,19,26,Driver & Passenger,Front,...,6,193,106,70,37,31.0,17.0,3405,non-USA,Audi 100
5,BMW,535i,Midsize,23.7,30.0,36.2,22,30,Driver only,Rear,...,4,186,109,69,39,27.0,13.0,3640,non-USA,BMW 535i

<a id = 'q40'></a>

**40. How to check if a dataframe has any missing values?**

[Go back to the table of contents](#table_of_contents)

In [80]:
# input
df = pd.read_csv("../input/cars93/Cars93.csv")
df

,Unnamed: 0,Manufacturer,Model,Type,Min.Price,Price,Max.Price,MPG.city,MPG.highway,AirBags,...,Passengers,Length,Wheelbase,Width,Turn.circle,Rear.seat.room,Luggage.room,Weight,Origin,Make
0,1,Acura,Integra,Small,12.9,15.9,18.8,25,31,None,...,5,177,102,68,37,26.5,11.0,2705,non-USA,Acura Integra
1,2,Acura,Legend,Midsize,29.2,33.9,38.7,18,25,Driver & Passenger,...,5,195,115,71,38,30.0,15.0,3560,non-USA,Acura Legend
2,3,Audi,90,Compact,25.9,29.1,32.3,20,26,Driver only,...,5,180,102,67,37,28.0,14.0,3375,non-USA,Audi 90
3,4,Audi,100,Midsize,30.8,37.7,44.6,19,26,Driver & Passenger,...,6,193,106,70,37,31.0,17.0,3405,non-USA,Audi 100
4,5,BMW,535i,Midsize,23.7,30.0,36.2,22,30,Driver only,...,4,186,109,69,39,27.0,13.0,3640,non-USA,BMW 535i
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
88,89,Volkswagen,Eurovan,Van,16.6,19.7,22.7,17,21,None,...,7,187,115,72,38,34.0,NaN,3960,non-USA,Volkswagen Eurovan
89,90,Volkswagen,Passat,Compact,17.6,20.0,22.4,21,30,None,...,5,180,103,67,35,31.5,14.0,2985,non-USA,Volkswagen Passat
90,91,Volkswagen,Corrado,Sporty,22.9,23.3,23.7,18,25,None,...,4,159,97,66,36,26.0,15.0,2810,non-USA,Volkswagen Corrado
91,92,Volvo,240,Compact,21.8,22.7,23.5,21,28,Driver only,...,5,190,104,67,37,29.5,14.0,2985,non-USA,Volvo 240
92,93,Volvo,850,Midsize,24.8,26.7,28.5,20,28,Driver & Passenger,...,5,184,105,69,38,30.0,15.0,3245,non-USA,Volvo 850

In [81]:
# Solution 1
print("Our df has a total of {} null values".format(df.isnull().sum().sum()))
print()

# Solution 2
df.isnull().values.any()
print()

# Solution 3
# A more detailed one
def report_nulls(df):
    '''
    Show a fast report of the DF.
    '''
    rows = df.shape[0]
    columns = df.shape[1]
    null_cols = 0
    list_of_nulls_cols = []
    for col in list(df.columns):
        null_values_rows = df[col].isnull().sum()
        null_rows_pcn = round(((null_values_rows)/rows)*100, 2)
        col_type = df[col].dtype
        if null_values_rows > 0:
            print("The column {} has {} null values. It is {}% of total rows.".format(col, null_values_rows, null_rows_pcn))
            print("The column {} is of type {}.\n".format(col, col_type))
            null_cols += 1
            list_of_nulls_cols.append(col)
    null_cols_pcn = round((null_cols/columns)*100, 2)
    print("The DataFrame has {} columns with null values. It is {}% of total columns.".format(null_cols, null_cols_pcn))
    return list_of_nulls_cols

report_nulls(df)

Our df has a total of 13 null values

True

The column Rear.seat.room has 2 null values. It is 2.15% of total rows.
The column Rear.seat.room is of type float64.

The column Luggage.room has 11 null values. It is 11.83% of total rows.
The column Luggage.room is of type float64.

The DataFrame has 2 columns with null values. It is 7.14% of total columns.

['Rear.seat.room', 'Luggage.room']

<a id = 'q41'></a>

**41. How to count the number of missing values in each column?**

Count the number of missing values in each column of df. Which column has the maximum number of missing values?

[Go back to the table of contents](#table_of_contents)

In [82]:
# input
df = pd.read_csv("../input/cars93/Cars93.csv")

In [83]:
# Solution 1
df_null = pd.DataFrame(df.isnull().sum())
df_null[df_null[0] > 0][0].argmax()
df_null[df_null[0] > 0][0].idxmax()

# Solution 2
# find the total number of nulls per column
n_missings_each_col = df.apply(lambda x: x.isnull().sum())

# find the maximum nulls
n_missings_each_col.argmax()
n_missings_each_col.idxmax()

/opt/conda/lib/python3.6/site-packages/ipykernel_launcher.py:3: FutureWarning:
The current behaviour of 'Series.argmax' is deprecated, use 'idxmax'
instead.
The behavior of 'argmax' will be corrected to return the positional
maximum in the future. For now, use 'series.values.argmax' or
'np.argmax(np.array(values))' to get the position of the maximum
row.
  This is separate from the ipykernel package so we can avoid doing imports until

'Luggage.room'

'Luggage.room'

/opt/conda/lib/python3.6/site-packages/ipykernel_launcher.py:11: FutureWarning:
The current behaviour of 'Series.argmax' is deprecated, use 'idxmax'
instead.
The behavior of 'argmax' will be corrected to return the positional
maximum in the future. For now, use 'series.values.argmax' or
'np.argmax(np.array(values))' to get the position of the maximum
row.
  # This is added back by InteractiveShellApp.init_path()

'Luggage.room'

'Luggage.room'

<a id = 'q42'></a>

**42. How to replace missing values of multiple numeric columns with the mean?**

Replace missing values in Luggage.room columns with their respective mean.

[Go back to the table of contents](#table_of_contents)

In [84]:
# input
df = pd.read_csv("../input/cars93/Cars93.csv")

In [85]:
# Solution 1
beg_null = df.isnull().sum().sum()
print(beg_null)
# notice that we have filtering the columns  as a list.
df[["Luggage.room"]] = df[["Luggage.room"]].apply(lambda x: x.fillna(x.mean()))
end_null = df.isnull().sum().sum()
print(end_null)

print("We have got rid of {} null values, filling them with the mean.".format(beg_null - end_null))

13
2
We have got rid of 11 null values, filling them with the mean.

<a id = 'q43'></a>

**43. How to use apply function on existing columns with global variables as additional arguments?**

In df, use apply method to replace the missing values in Rear.seat.room with mean Luggage.room with median by passing an argument to the function.

[Go back to the table of contents](#table_of_contents)

In [86]:
# input
df = pd.read_csv("../input/cars93/Cars93.csv")

In [87]:
# input
df = pd.read_csv("../input/cars93/Cars93.csv")

# Solution 1
print("We have a total of {} nulls".format(df.isnull().sum().sum()))

d = {'Rear.seat.room': np.nanmean, 'Luggage.room': np.nanmedian}
df[['Rear.seat.room', 'Luggage.room']] = df[['Rear.seat.room', 'Luggage.room']].apply(lambda x, d: x.fillna(d[x.name](x)), args=(d, ))

print("We have a total of {} nulls".format(df.isnull().sum().sum()))

df["Rear.seat.room"].sum()
df["Luggage.room"].sum()


# Solution 2
# impor the df
df = pd.read_csv("../input/cars93/Cars93.csv")

# check nulls
print("We have a total of {} nulls".format(df.isnull().sum().sum()))

# define a custom function
def num_inputer(x, strategy):
    if strategy.lower() == "mean":
        x = x.fillna(value = np.nanmean(x))
    if strategy.lower() == "median":
        x = x.fillna(value = np.nanmedian(x))
    return x

# apply the custon function and using args whe can pass the strategy we want
df['Rear.seat.room'] = df[['Rear.seat.room']].apply(num_inputer, args = ["mean"])
df['Luggage.room'] = df[['Luggage.room']].apply(num_inputer, args = ["median"])

# check for nulls
print("We have a total of {} nulls".format(df.isnull().sum().sum()))

df["Rear.seat.room"].sum()
df["Luggage.room"].sum()

We have a total of 13 nulls
We have a total of 0 nulls

2588.1593406593406

1293.0

We have a total of 13 nulls
We have a total of 0 nulls

2588.1593406593406

1293.0

<a id = 'q44'></a>

**44. How to select a specific column from a dataframe as a dataframe instead of a series?**

Get the first column (a) in df as a dataframe (rather than as a Series).

[Go back to the table of contents](#table_of_contents)

In [88]:
 # input
df = pd.DataFrame(np.arange(20).reshape(-1, 5), columns=list('abcde'))

In [89]:
# Solution
# using to_frame()
type(df["a"].to_frame())
# using pandas DataFrame
type(pd.DataFrame(df["a"]))

# Other solutions
# Solution
type(df[['a']])
type(df.loc[:, ['a']])
type(df.iloc[:, [0]])

# This returns a series
# Alternately the following returns a Series
type(df.a)
type(df['a'])
type(df.loc[:, 'a'])
type(df.iloc[:, 1])

pandas.core.frame.DataFrame

pandas.core.frame.DataFrame

pandas.core.frame.DataFrame

pandas.core.frame.DataFrame

pandas.core.frame.DataFrame

pandas.core.series.Series

pandas.core.series.Series

pandas.core.series.Series

pandas.core.series.Series

<a id = 'q45'></a>

**45. How to change the order of columns of a dataframe?**

Actually 3 questions.

1. In df, interchange columns 'a' and 'c'.

2. Create a generic function to interchange two columns, without hardcoding column names.

3. Sort the columns in reverse alphabetical order, that is colume 'e' first through column 'a' last.

[Go back to the table of contents](#table_of_contents)

In [90]:
# input
df = pd.DataFrame(np.arange(20).reshape(-1, 5), columns=list('abcde'))

In [91]:
# Solution to question 1
# we pass a list with the custom names BUT THIS DOESN'T change in place
df = pd.DataFrame(np.arange(20).reshape(-1, 5), columns=list('abcde'))
df[["c", "b", "a", "d", "e"]]
df

# if we reasing that this will work
df = df[["c", "b", "a", "d", "e"]]
df

# Solution to question 2
def change_cols(df, col1, col2):
    df_columns = df.columns.to_list()
    index1 = df_columns.index(col1)
    index2 = df_columns.index(col2)
    # swaping values
    df_columns[index1], df_columns[index2] = col1, col2
    
    return df[df_columns]


df = change_cols(df, "b", "e")
df
    

# Solution to question 3
df = pd.DataFrame(np.arange(20).reshape(-1, 5), columns=list('abcde'))
col_list = list(df.columns)
col_list_reversed = col_list[::-1]
col_list
col_list_reversed
# using the trick from solution 1
df = df[col_list_reversed]
df


print("Solution from the website")
print("-------------------------")
# Others solution from the website

# Input
df = pd.DataFrame(np.arange(20).reshape(-1, 5), columns=list('abcde'))

# Solution Q1
df[list('cbade')]

# Solution Q2 - No hard coding
def switch_columns(df, col1=None, col2=None):
    colnames = df.columns.tolist()
    i1, i2 = colnames.index(col1), colnames.index(col2)
    colnames[i2], colnames[i1] = colnames[i1], colnames[i2]
    return df[colnames]

df1 = switch_columns(df, 'a', 'c')

# Solution Q3
df[sorted(df.columns)]
# or
df.sort_index(axis=1, ascending=False, inplace=True)

    c   b   a   d   e
0   2   1   0   3   4
1   7   6   5   8   9
2  12  11  10  13  14
3  17  16  15  18  19

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

    c   b   a   d   e
0   2   1   0   3   4
1   7   6   5   8   9
2  12  11  10  13  14
3  17  16  15  18  19

    c   b   a   d   e
0   2   1   0   3   4
1   7   6   5   8   9
2  12  11  10  13  14
3  17  16  15  18  19

['a', 'b', 'c', 'd', 'e']

['e', 'd', 'c', 'b', 'a']

    e   d   c   b   a
0   4   3   2   1   0
1   9   8   7   6   5
2  14  13  12  11  10
3  19  18  17  16  15

Solution from the website
-------------------------

    c   b   a   d   e
0   2   1   0   3   4
1   7   6   5   8   9
2  12  11  10  13  14
3  17  16  15  18  19

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

<a id = 'q46'></a>

**46. How to set the number of rows and columns displayed in the output?**

Change the pandas display settings on printing the dataframe df it shows a maximum of 10 rows and 10 columns.


[Go back to the table of contents](#table_of_contents)

In [92]:
# input
df = pd.read_csv("../input/cars93/Cars93.csv")

In [93]:
# we use set_option to set the maximun rows and columns to display
pd.set_option("display.max_columns",10)
pd.set_option("display.max_rows",10)
df

,Unnamed: 0,Manufacturer,Model,Type,Min.Price,...,Rear.seat.room,Luggage.room,Weight,Origin,Make
0,1,Acura,Integra,Small,12.9,...,26.5,11.0,2705,non-USA,Acura Integra
1,2,Acura,Legend,Midsize,29.2,...,30.0,15.0,3560,non-USA,Acura Legend
2,3,Audi,90,Compact,25.9,...,28.0,14.0,3375,non-USA,Audi 90
3,4,Audi,100,Midsize,30.8,...,31.0,17.0,3405,non-USA,Audi 100
4,5,BMW,535i,Midsize,23.7,...,27.0,13.0,3640,non-USA,BMW 535i
...,...,...,...,...,...,...,...,...,...,...,...
88,89,Volkswagen,Eurovan,Van,16.6,...,34.0,NaN,3960,non-USA,Volkswagen Eurovan
89,90,Volkswagen,Passat,Compact,17.6,...,31.5,14.0,2985,non-USA,Volkswagen Passat
90,91,Volkswagen,Corrado,Sporty,22.9,...,26.0,15.0,2810,non-USA,Volkswagen Corrado
91,92,Volvo,240,Compact,21.8,...,29.5,14.0,2985,non-USA,Volvo 240
92,93,Volvo,850,Midsize,24.8,...,30.0,15.0,3245,non-USA,Volvo 850

<a id = 'q47'></a>

**47. How to format or suppress scientific notations in a pandas dataframe?**

Suppress scientific notations like ‘e-03’ in df and print upto 4 numbers after decimal.


[Go back to the table of contents](#table_of_contents)

In [94]:
# input
df = pd.DataFrame(np.random.random(5)**10, columns=['random'])

'''
Desired Output
#>    random
#> 0  0.0035
#> 1  0.0000
#> 2  0.0747
#> 3  0.0000
'''

'\nDesired Output\n#>    random\n#> 0  0.0035\n#> 1  0.0000\n#> 2  0.0747\n#> 3  0.0000\n'

In [95]:
print("Initial DF")
df
print("Using solution 1")
# Solution 1
df.round(4)
df
pd.reset_option('^display.', silent=True)

print("Using solution 2")
# Solution 2
df.apply(lambda x: '%.4f' %x, axis=1).to_frame()
df
pd.reset_option('^display.', silent=True)

print("Using solution 3")
# Solution 3
pd.set_option('display.float_format', lambda x: '%.4f'%x)
df
pd.reset_option('^display.', silent=True)
df

Initial DF

         random
0  1.678401e-04
1  2.884898e-10
2  8.902106e-01
3  2.157189e-03
4  1.698862e-08

Using solution 1

   random
0  0.0002
1  0.0000
2  0.8902
3  0.0022
4  0.0000

         random
0  1.678401e-04
1  2.884898e-10
2  8.902106e-01
3  2.157189e-03
4  1.698862e-08

Using solution 2

        0
0  0.0002
1  0.0000
2  0.8902
3  0.0022
4  0.0000

         random
0  1.678401e-04
1  2.884898e-10
2  8.902106e-01
3  2.157189e-03
4  1.698862e-08

Using solution 3

   random
0  0.0002
1  0.0000
2  0.8902
3  0.0022
4  0.0000

         random
0  1.678401e-04
1  2.884898e-10
2  8.902106e-01
3  2.157189e-03
4  1.698862e-08

<a id = 'q48'></a>

**48. How to format all the values in a dataframe as percentages?**

Format the values in column 'random' of df as percentages.


[Go back to the table of contents](#table_of_contents)

In [96]:
# input
df = pd.DataFrame(np.random.random(4), columns=['random'])
df

     random
0  0.495464
1  0.739176
2  0.634417
3  0.622548

In [97]:
# Solution 1
# Using style.format we can pass a dictionary to each column and display as we want
out = df.style.format({
    'random': '{0:.2%}'.format,
})
out

# This applies to all the df
pd.options.display.float_format = '{:,.2f}%'.format
# to get the % multiply by 100
df*100
pd.reset_option('^display.', silent=True)

   random
0  49.55%
1  73.92%
2  63.44%
3  62.25%

<a id = 'q49'></a>

**49. How to filter every nth row in a dataframe?**

From df, filter the 'Manufacturer', 'Model' and 'Type' for every 20th row starting from 1st (row 0).

[Go back to the table of contents](#table_of_contents)

In [98]:
# input
df = pd.read_csv("../input/cars93/Cars93.csv")
df

,Unnamed: 0,Manufacturer,Model,Type,Min.Price,Price,Max.Price,MPG.city,MPG.highway,AirBags,...,Passengers,Length,Wheelbase,Width,Turn.circle,Rear.seat.room,Luggage.room,Weight,Origin,Make
0,1,Acura,Integra,Small,12.9,15.9,18.8,25,31,None,...,5,177,102,68,37,26.5,11.0,2705,non-USA,Acura Integra
1,2,Acura,Legend,Midsize,29.2,33.9,38.7,18,25,Driver & Passenger,...,5,195,115,71,38,30.0,15.0,3560,non-USA,Acura Legend
2,3,Audi,90,Compact,25.9,29.1,32.3,20,26,Driver only,...,5,180,102,67,37,28.0,14.0,3375,non-USA,Audi 90
3,4,Audi,100,Midsize,30.8,37.7,44.6,19,26,Driver & Passenger,...,6,193,106,70,37,31.0,17.0,3405,non-USA,Audi 100
4,5,BMW,535i,Midsize,23.7,30.0,36.2,22,30,Driver only,...,4,186,109,69,39,27.0,13.0,3640,non-USA,BMW 535i
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
88,89,Volkswagen,Eurovan,Van,16.6,19.7,22.7,17,21,None,...,7,187,115,72,38,34.0,NaN,3960,non-USA,Volkswagen Eurovan
89,90,Volkswagen,Passat,Compact,17.6,20.0,22.4,21,30,None,...,5,180,103,67,35,31.5,14.0,2985,non-USA,Volkswagen Passat
90,91,Volkswagen,Corrado,Sporty,22.9,23.3,23.7,18,25,None,...,4,159,97,66,36,26.0,15.0,2810,non-USA,Volkswagen Corrado
91,92,Volvo,240,Compact,21.8,22.7,23.5,21,28,Driver only,...,5,190,104,67,37,29.5,14.0,2985,non-USA,Volvo 240
92,93,Volvo,850,Midsize,24.8,26.7,28.5,20,28,Driver & Passenger,...,5,184,105,69,38,30.0,15.0,3245,non-USA,Volvo 850

In [99]:
# First let's import only the columns we need
df = pd.read_csv("../input/cars93/Cars93.csv", usecols=["Manufacturer", "Model", "Type"])

# Solution 1
# Using normal python slicing
df[::20]

df = pd.read_csv("../input/cars93/Cars93.csv", usecols=["Manufacturer", "Model", "Type"])

# Solution 2
# Using iloc
df.iloc[::20, :][['Manufacturer', 'Model', 'Type']]

   Manufacturer    Model     Type
0         Acura  Integra    Small
20     Chrysler  LeBaron  Compact
40        Honda  Prelude   Sporty
60      Mercury   Cougar  Midsize
80       Subaru   Loyale    Small

   Manufacturer    Model     Type
0         Acura  Integra    Small
20     Chrysler  LeBaron  Compact
40        Honda  Prelude   Sporty
60      Mercury   Cougar  Midsize
80       Subaru   Loyale    Small

<a id = 'q50'></a>

**50. How to create a primary key index by combining relevant columns?**

In df, Replace NaNs with ‘missing’ in columns 'Manufacturer', 'Model' and 'Type' and create a index as a combination of these three columns and check if the index is a primary key.

[Go back to the table of contents](#table_of_contents)

In [100]:
# input
df = pd.read_csv("../input/cars93/Cars93.csv")
df

,Unnamed: 0,Manufacturer,Model,Type,Min.Price,Price,Max.Price,MPG.city,MPG.highway,AirBags,...,Passengers,Length,Wheelbase,Width,Turn.circle,Rear.seat.room,Luggage.room,Weight,Origin,Make
0,1,Acura,Integra,Small,12.9,15.9,18.8,25,31,None,...,5,177,102,68,37,26.5,11.0,2705,non-USA,Acura Integra
1,2,Acura,Legend,Midsize,29.2,33.9,38.7,18,25,Driver & Passenger,...,5,195,115,71,38,30.0,15.0,3560,non-USA,Acura Legend
2,3,Audi,90,Compact,25.9,29.1,32.3,20,26,Driver only,...,5,180,102,67,37,28.0,14.0,3375,non-USA,Audi 90
3,4,Audi,100,Midsize,30.8,37.7,44.6,19,26,Driver & Passenger,...,6,193,106,70,37,31.0,17.0,3405,non-USA,Audi 100
4,5,BMW,535i,Midsize,23.7,30.0,36.2,22,30,Driver only,...,4,186,109,69,39,27.0,13.0,3640,non-USA,BMW 535i
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
88,89,Volkswagen,Eurovan,Van,16.6,19.7,22.7,17,21,None,...,7,187,115,72,38,34.0,NaN,3960,non-USA,Volkswagen Eurovan
89,90,Volkswagen,Passat,Compact,17.6,20.0,22.4,21,30,None,...,5,180,103,67,35,31.5,14.0,2985,non-USA,Volkswagen Passat
90,91,Volkswagen,Corrado,Sporty,22.9,23.3,23.7,18,25,None,...,4,159,97,66,36,26.0,15.0,2810,non-USA,Volkswagen Corrado
91,92,Volvo,240,Compact,21.8,22.7,23.5,21,28,Driver only,...,5,190,104,67,37,29.5,14.0,2985,non-USA,Volvo 240
92,93,Volvo,850,Midsize,24.8,26.7,28.5,20,28,Driver & Passenger,...,5,184,105,69,38,30.0,15.0,3245,non-USA,Volvo 850

In [101]:
# Solution
df = pd.read_csv("../input/cars93/Cars93.csv", usecols=["Manufacturer", "Model", "Type", "Min.Price", "Max.Price"])

# let's check if we have null
df.isnull().sum().sum()
df.fillna("missing")
# create new index
df["new_index"] = df["Manufacturer"] + df["Model"] + df["Type"]
# set new index
df.set_index("new_index", inplace = True)
df

0

   Manufacturer    Model     Type  Min.Price  Max.Price
0         Acura  Integra    Small       12.9       18.8
1         Acura   Legend  Midsize       29.2       38.7
2          Audi       90  Compact       25.9       32.3
3          Audi      100  Midsize       30.8       44.6
4           BMW     535i  Midsize       23.7       36.2
..          ...      ...      ...        ...        ...
88   Volkswagen  Eurovan      Van       16.6       22.7
89   Volkswagen   Passat  Compact       17.6       22.4
90   Volkswagen  Corrado   Sporty       22.9       23.7
91        Volvo      240  Compact       21.8       23.5
92        Volvo      850  Midsize       24.8       28.5

[93 rows x 5 columns]

                        Manufacturer    Model     Type  Min.Price  Max.Price
new_index
AcuraIntegraSmall              Acura  Integra    Small       12.9       18.8
AcuraLegendMidsize             Acura   Legend  Midsize       29.2       38.7
Audi90Compact                   Audi       90  Compact       25.9       32.3
Audi100Midsize                  Audi      100  Midsize       30.8       44.6
BMW535iMidsize                   BMW     535i  Midsize       23.7       36.2
...                              ...      ...      ...        ...        ...
VolkswagenEurovanVan      Volkswagen  Eurovan      Van       16.6       22.7
VolkswagenPassatCompact   Volkswagen   Passat  Compact       17.6       22.4
VolkswagenCorradoSporty   Volkswagen  Corrado   Sporty       22.9       23.7
Volvo240Compact                Volvo      240  Compact       21.8       23.5
Volvo850Midsize                Volvo      850  Midsize       24.8       28.5

[93 rows x 5 columns]

<a id = 'q51'></a>

**51. How to get the row number of the nth largest value in a column?**

Find the row position of the 5th largest value of column 'a' in df.

[Go back to the table of contents](#table_of_contents)

In [102]:
# input
df = pd.DataFrame(np.random.randint(1, 30, 30).reshape(10,-1), columns=list('abc'))
df

    a   b   c
0  15   9  29
1   2   1   1
2  10   9  13
3  19   4  10
4  15  22  21
5  12  13  12
6  22  11  26
7   7   9  18
8  13  17  15
9  16  12  15

In [103]:
# Solution 1

# argsort give the index of the smallest to largest number in an array
# arg_sort[0] is the index of the smallest number in df["a"]
arg_sort = df["a"].argsort()

#arg_sort.to_frame()
#arg_sort[0]

# now let's sort by arg_sort
#df
df = df.iloc[arg_sort]
df["arg_sort"] = arg_sort
df
n_largest = 5
print("The {} largest values in our DF is at row/index {} and the value is {}".format(n_largest, (df[df["arg_sort"] == (n_largest-1)].index[0]), df[df["arg_sort"] == (n_largest-1)]["a"].iloc[0]))

# Shorter solution
n = 5
# select column, argsort, inders (largest to smallest) and select the n largest
df['a'].argsort()[::-1][n]

/opt/conda/lib/python3.6/site-packages/ipykernel_launcher.py:13: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  del sys.path[0]

    a   b   c  arg_sort
1   2   1   1         7
7   7   9  18         9
2  10   9  13         2
5  12  13  12         0
8  13  17  15         3
0  15   9  29         1
4  15  22  21         8
9  16  12  15         6
3  19   4  10         5
6  22  11  26         4

The 5 largest values in our DF is at row/index 6 and the value is 22

3

<a id = 'q52'></a>

**52. How to find the position of the nth largest value greater than a given value?**

In ser, find the position of the 2nd largest value greater than the mean.

[Go back to the table of contents](#table_of_contents)

In [104]:
# input
ser = pd.Series(np.random.randint(1, 100, 15))

In [105]:
# Solution using argsort and boolean filtering of pandas series
# I understood that I wanted the second largest of all values that is greter than the mean
# so I sorted
#ser
sorted_ser = ser[ser.argsort()[::-1]]
#sorted_ser
sorted_ser[sorted_ser > sorted_ser.mean()].index[1]

# If you understood that the 2 value you encounter that is bigger than the mean
# This is the correct solution
print('ser: ', ser.tolist(), 'mean: ', round(ser.mean()))
np.argwhere(ser > ser.mean())[1]

# Another solution
ser[ser > ser.mean()].index[1]

10

ser:  [48, 79, 81, 9, 52, 21, 79, 55, 30, 98, 96, 48, 54, 69, 66] mean:  59

/opt/conda/lib/python3.6/site-packages/numpy/core/fromnumeric.py:61: FutureWarning: Series.nonzero() is deprecated and will be removed in a future version.Use Series.to_numpy().nonzero() instead
  return bound(*args, **kwds)

array([2])

2


<a id = 'q53'></a>

**53. How to get the last n rows of a dataframe with row sum > 100?**

Get the last two rows of df whose row sum is greater than 100.

[Go back to the table of contents](#table_of_contents)

In [106]:
# input
df = pd.DataFrame(np.random.randint(10, 40, 60).reshape(-1, 4))
df1 = df.copy(deep = True)

In [107]:
# Solution 1
df["sum"] = df.sum(axis = 1)
df

print("The index of the rows that are greater than 100 are {}".format((df[df["sum"] > 100].index).to_list()[-2:]))

# Solution 2 using numpy
rowsums = df1.apply(np.sum, axis=1)

# last two rows with row sum greater than 100
last_two_rows = df1.iloc[np.where(rowsums > 100)[0][-2:], :]
last_two_rows

     0   1   2   3  sum
0   14  37  13  11   75
1   34  19  20  19   92
2   16  33  36  22  107
3   38  37  32  11  118
4   14  16  39  16   85
5   21  36  30  29  116
6   32  29  29  18  108
7   19  35  28  21  103
8   12  36  22  29   99
9   28  39  15  17   99
10  16  21  37  35  109
11  33  22  20  18   93
12  13  28  21  21   83
13  31  22  22  14   89
14  36  13  38  24  111

The index of the rows that are greater than 100 are [10, 14]

     0   1   2   3
10  16  21  37  35
14  36  13  38  24


<a id = 'q54'></a>

**54. How to find and cap outliers from a series or dataframe column?**

Replace all values of ser in the lower 5%ile and greater than 95%ile with respective 5th and 95th %ile value.

[Go back to the table of contents](#table_of_contents)

In [108]:
# input
ser = pd.Series(np.logspace(-2, 2, 30))
ser1 = ser.copy(deep = True)
ser2 = ser.copy(deep = True)

In [109]:
# Solution 1
# get the quantiles values
quantiles = np.quantile(ser, [0.05, 0.95])
ser

# filter ser using numpy to know where the values are below or greater than 5% or 95% and replace the values
ser.iloc[np.where(ser < quantiles[0])] = quantiles[0]
ser.iloc[np.where(ser > quantiles[1])] = quantiles[1]
    
# or we can just do
ser1[ser1 < quantiles[0]] = quantiles[0]
ser1[ser1 > quantiles[1]] = quantiles[1]

ser1

# Solution from the webpage
def cap_outliers(ser, low_perc, high_perc):
    low, high = ser.quantile([low_perc, high_perc])
    print(low_perc, '%ile: ', low, '|', high_perc, '%ile: ', high)
    ser[ser < low] = low
    ser[ser > high] = high
    return(ser)

capped_ser = cap_outliers(ser2, .05, .95)
ser2
capped_ser

0       0.010000
1       0.013738
2       0.018874
3       0.025929
4       0.035622
5       0.048939
6       0.067234
7       0.092367
8       0.126896
9       0.174333
10      0.239503
11      0.329034
12      0.452035
13      0.621017
14      0.853168
15      1.172102
16      1.610262
17      2.212216
18      3.039195
19      4.175319
20      5.736153
21      7.880463
22     10.826367
23     14.873521
24     20.433597
25     28.072162
26     38.566204
27     52.983169
28     72.789538
29    100.000000
dtype: float64

0      0.016049
1      0.016049
2      0.018874
3      0.025929
4      0.035622
5      0.048939
6      0.067234
7      0.092367
8      0.126896
9      0.174333
10     0.239503
11     0.329034
12     0.452035
13     0.621017
14     0.853168
15     1.172102
16     1.610262
17     2.212216
18     3.039195
19     4.175319
20     5.736153
21     7.880463
22    10.826367
23    14.873521
24    20.433597
25    28.072162
26    38.566204
27    52.983169
28    63.876672
29    63.876672
dtype: float64

0.05 %ile:  0.016049294076965887 | 0.95 %ile:  63.876672220183934

0      0.016049
1      0.016049
2      0.018874
3      0.025929
4      0.035622
5      0.048939
6      0.067234
7      0.092367
8      0.126896
9      0.174333
10     0.239503
11     0.329034
12     0.452035
13     0.621017
14     0.853168
15     1.172102
16     1.610262
17     2.212216
18     3.039195
19     4.175319
20     5.736153
21     7.880463
22    10.826367
23    14.873521
24    20.433597
25    28.072162
26    38.566204
27    52.983169
28    63.876672
29    63.876672
dtype: float64

0      0.016049
1      0.016049
2      0.018874
3      0.025929
4      0.035622
5      0.048939
6      0.067234
7      0.092367
8      0.126896
9      0.174333
10     0.239503
11     0.329034
12     0.452035
13     0.621017
14     0.853168
15     1.172102
16     1.610262
17     2.212216
18     3.039195
19     4.175319
20     5.736153
21     7.880463
22    10.826367
23    14.873521
24    20.433597
25    28.072162
26    38.566204
27    52.983169
28    63.876672
29    63.876672
dtype: float64


<a id = 'q55'></a>

**55. How to reshape a dataframe to the largest possible square after removing the negative values?**

Reshape df to the largest possible square with negative values removed. Drop the smallest values if need be. 
The order of the positive numbers in the result should remain the same as the original.

[Go back to the table of contents](#table_of_contents)

In [110]:
# input
df = pd.DataFrame(np.random.randint(-20, 50, 100).reshape(10,-1))

In [111]:
# This solution sorts the values.
# Not want we want
# my_array = np.array(df.values.reshape(-1, 1))
# my_array = my_array[my_array > 0]
# my_array.shape[0]
# lar_square = int(np.floor(my_array.shape[0]**0.5))
# arg_sort = np.argsort(my_array)[::-1]
# my_array[arg_sort][0:lar_square**2].reshape(lar_square, lar_square)


# Correct solution
my_array = np.array(df.values.reshape(-1, 1)) # convert to numpy
my_array = my_array[my_array > 0] # filter only positive values
lar_square = int(np.floor(my_array.shape[0]**0.5)) # find the largest square
arg_sort = np.argsort(my_array)[::-1][0:lar_square**2] # eliminate the smallest values that will prevent from converting to a square
my_array = np.take(my_array, sorted(arg_sort)).reshape(lar_square, lar_square) # filter the array and reshape back
my_array


# Solution from the webpage
# Step 1: remove negative values from arr
arr = df[df > 0].values.flatten()
arr_qualified = arr[~np.isnan(arr)]

# Step 2: find side-length of largest possible square
n = int(np.floor(arr_qualified.shape[0]**.5))

# Step 3: Take top n^2 items without changing positions
top_indexes = np.argsort(arr_qualified)[::-1]
output = np.take(arr_qualified, sorted(top_indexes[:n**2])).reshape(n, -1)
print(output)

array([[39, 18, 33, 13, 17, 12, 15, 30],
       [37,  8, 13, 20, 42, 37,  9, 24],
       [19, 30, 15, 42, 36, 40, 47, 47],
       [36, 15, 16, 33, 33, 23, 19, 15],
       [41, 32, 13, 33, 11, 33, 26,  8],
       [47, 13, 14, 24, 15, 38, 39, 19],
       [46, 26, 30, 41, 27,  8, 44, 33],
       [43, 12, 36,  9, 14, 18, 20, 26]])

[[39. 18. 33. 13. 17. 12. 15. 30.]
 [37.  8. 13. 20. 42. 37.  9. 24.]
 [19. 30. 15. 42. 36. 40. 47. 47.]
 [36. 15. 16. 33. 33. 23. 19. 15.]
 [41. 32. 13. 33. 11. 33. 26.  8.]
 [47. 13. 14. 24. 15. 38. 39. 19.]
 [46. 26. 30. 41. 27.  8. 44. 33.]
 [43. 12. 36.  9. 14. 18. 20. 26.]]


<a id = 'q56'></a>

**56. How to swap two rows of a dataframe?**

Swap rows 1 and 2 in df.

[Go back to the table of contents](#table_of_contents)

In [112]:
# input
df = pd.DataFrame(np.arange(25).reshape(5, -1))
df

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24

In [113]:
# THIS SWAPS the columns
print("Original DataFrame")
df
temp_col = df[1].copy(deep = True)
df[1], df[2] = df[2], temp_col
print("Swapped Columns DataFrame")
df

# # THIS SWAPS the rows
print("Original DataFrame")
df
temp_row = df.iloc[1].copy(deep = True)
df.iloc[1], df.iloc[2] = df.iloc[2], temp_row
print("Swapped Rows DataFrame")
df

# Solution from the webpage
def swap_rows(df, i1, i2):
    a, b = df.iloc[i1, :].copy(), df.iloc[i2, :].copy()
    df.iloc[i1, :], df.iloc[i2, :] = b, a
    return df

print(swap_rows(df, 1, 2))

Original DataFrame

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24

Swapped Columns DataFrame

    0   1   2   3   4
0   0   2   1   3   4
1   5   7   6   8   9
2  10  12  11  13  14
3  15  17  16  18  19
4  20  22  21  23  24

Original DataFrame

    0   1   2   3   4
0   0   2   1   3   4
1   5   7   6   8   9
2  10  12  11  13  14
3  15  17  16  18  19
4  20  22  21  23  24

Swapped Rows DataFrame

    0   1   2   3   4
0   0   2   1   3   4
1  10  12  11  13  14
2   5   7   6   8   9
3  15  17  16  18  19
4  20  22  21  23  24

    0   1   2   3   4
0   0   2   1   3   4
1   5   7   6   8   9
2  10  12  11  13  14
3  15  17  16  18  19
4  20  22  21  23  24


<a id = 'q57'></a>

**57. How to reverse the rows of a dataframe?**

Reverse all the rows of dataframe df.

[Go back to the table of contents](#table_of_contents)

In [114]:
# input
df = pd.DataFrame(np.arange(25).reshape(5, -1))

In [115]:
# Solution 1
df
df.iloc[df.index.to_list()[::-1]]

# Solutions from the webpage
# Solution 2
df.iloc[::-1, :]

# Solution 3
print(df.loc[df.index[::-1], :])

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24

    0   1   2   3   4
4  20  21  22  23  24
3  15  16  17  18  19
2  10  11  12  13  14
1   5   6   7   8   9
0   0   1   2   3   4

    0   1   2   3   4
4  20  21  22  23  24
3  15  16  17  18  19
2  10  11  12  13  14
1   5   6   7   8   9
0   0   1   2   3   4

    0   1   2   3   4
4  20  21  22  23  24
3  15  16  17  18  19
2  10  11  12  13  14
1   5   6   7   8   9
0   0   1   2   3   4


<a id = 'q58'></a>

**58. How to create one-hot encodings of a categorical variable (dummy variables)?**

Get one-hot encodings for column 'a' in the dataframe df and append it as columns.

[Go back to the table of contents](#table_of_contents)

In [116]:
# input
df = pd.DataFrame(np.arange(25).reshape(5,-1), columns=list('abcde'))

'''
Desired Output

   0  5  10  15  20   b   c   d   e
0  1  0   0   0   0   1   2   3   4
1  0  1   0   0   0   6   7   8   9
2  0  0   1   0   0  11  12  13  14
3  0  0   0   1   0  16  17  18  19
4  0  0   0   0   1  21  22  23  24
'''

'\nDesired Output\n\n   0  5  10  15  20   b   c   d   e\n0  1  0   0   0   0   1   2   3   4\n1  0  1   0   0   0   6   7   8   9\n2  0  0   1   0   0  11  12  13  14\n3  0  0   0   1   0  16  17  18  19\n4  0  0   0   0   1  21  22  23  24\n'

In [117]:
# Using pd.get_dummies
dummies = pd.get_dummies(df["a"])
df = pd.concat([dummies, df], axis = 1)
df

# Solution from the webpage
# in one line
df_onehot = pd.concat([pd.get_dummies(df['a']), df[list('bcde')]], axis=1)
df_onehot

   0  5  10  15  20   a   b   c   d   e
0  1  0   0   0   0   0   1   2   3   4
1  0  1   0   0   0   5   6   7   8   9
2  0  0   1   0   0  10  11  12  13  14
3  0  0   0   1   0  15  16  17  18  19
4  0  0   0   0   1  20  21  22  23  24

   0  5  10  15  20   b   c   d   e
0  1  0   0   0   0   1   2   3   4
1  0  1   0   0   0   6   7   8   9
2  0  0   1   0   0  11  12  13  14
3  0  0   0   1   0  16  17  18  19
4  0  0   0   0   1  21  22  23  24


<a id = 'q59'></a>

**59. Which column contains the highest number of row-wise maximum values?**

Obtain the column name with the highest number of row-wise maximum’s in df.

[Go back to the table of contents](#table_of_contents)

In [118]:
# input
df = pd.DataFrame(np.random.randint(1,100, 40).reshape(10, -1))

In [119]:
# Solution 1
def get_col(df):
    columns = list(df.columns)
    df["col_index_with_max"] = ""
    for i in range(len(df)):
        row_values = list(df.iloc[i, :-1].values)
        max_value = np.max(row_values)
        col_index = row_values.index(max_value)
        df["col_index_with_max"].iloc[i] = col_index

get_col(df)

df
print("The col with maximum amont of maximun per row if {} with a total of {} maximus".format(df.groupby("col_index_with_max").size()[::-1].index[0], \
                                                                                              df.groupby("col_index_with_max").size()[::-1].values[0]))

# Solution 2
# Another much more elegant solution from the webpage
print('Column with highest row maxes: ', df.apply(np.argmax, axis=1).value_counts().index[0])

/opt/conda/lib/python3.6/site-packages/pandas/core/indexing.py:205: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_with_indexer(indexer, value)

    0   1   2   3  col_index_with_max
0  77  71  37  83                   3
1  46  39  43  77                   3
2   1  44  28  50                   3
3   6  22  32  12                   2
4  22  56  44  39                   1
5  64  17  62  89                   3
6  51  20  44  49                   0
7  59  56  53   8                   0
8   7  98  78  43                   1
9  66  20  43  52                   0

The col with maximum amont of maximun per row if 3 with a total of 4 maximus
Column with highest row maxes:  3

/opt/conda/lib/python3.6/site-packages/numpy/core/fromnumeric.py:61: FutureWarning:
The current behaviour of 'Series.argmax' is deprecated, use 'idxmax'
instead.
The behavior of 'argmax' will be corrected to return the positional
maximum in the future. For now, use 'series.values.argmax' or
'np.argmax(np.array(values))' to get the position of the maximum
row.
  return bound(*args, **kwds)


<a id = 'q60'></a>

**60. How to create a new column that contains the row number of nearest column by euclidean distance?**

Create a new column such that, each row contains the row number of nearest row-record by euclidean distance.

[Go back to the table of contents](#table_of_contents)

In [120]:
# input
df = pd.DataFrame(np.random.randint(1,100, 40).reshape(10, -1), columns=list('pqrs'), index=list('abcdefghij'))

'''
Desired Output

df
#    p   q   r   s nearest_row   dist
# a  57  77  13  62           i  116.0
# b  68   5  92  24           a  114.0
# c  74  40  18  37           i   91.0
# d  80  17  39  60           i   89.0
# e  93  48  85  33           i   92.0
# f  69  55   8  11           g  100.0
# g  39  23  88  53           f  100.0
# h  63  28  25  61           i   88.0
# i  18   4  73   7           a  116.0
# j  79  12  45  34           a   81.0

'''

'\nDesired Output\n\ndf\n#    p   q   r   s nearest_row   dist\n# a  57  77  13  62           i  116.0\n# b  68   5  92  24           a  114.0\n# c  74  40  18  37           i   91.0\n# d  80  17  39  60           i   89.0\n# e  93  48  85  33           i   92.0\n# f  69  55   8  11           g  100.0\n# g  39  23  88  53           f  100.0\n# h  63  28  25  61           i   88.0\n# i  18   4  73   7           a  116.0\n# j  79  12  45  34           a   81.0\n\n'

In [121]:
#######################################################################################################################################
# Solution 1
# input
df = pd.DataFrame(np.random.randint(1,100, 40).reshape(10, -1), columns=list('pqrs'), index=list('abcdefghij'))

# place holders
corr_list = []
index_list = []

# temporary var
max_corr = 0
current_index = ""

# nested loop to calculate
for i in range(len(df)):
    for j in range(len(df)):
        if i == j:
            pass
        else:
            # distance
            curr_corr = sum((df.iloc[i] - df.iloc[j])**2)**.5
            # correlation
            #curr_corr = df.iloc[i].corr(df.iloc[j])
            if curr_corr >= max_corr:
                max_corr = curr_corr
                current_index = list(df.index)[j]
                
    corr_list.append(max_corr)
    index_list.append(current_index)
    
    max_corr = 0
    current_index = ""
    
df["nearest_row"] = index_list
df["dist"] = corr_list
df
df.drop(["nearest_row", "dist"], axis = 1, inplace = True)

#######################################################################################################################################

# Solution from the webpage
# init outputs
nearest_rows = []
nearest_distance = []

# iterate rows.
for i, row in df.iterrows():
    curr = row
    rest = df.drop(i)
    e_dists = {}  # init dict to store euclidean dists for current row.
    # iterate rest of rows for current row
    for j, contestant in rest.iterrows():
        # compute euclidean dist and update e_dists
        e_dists.update({j: round(np.linalg.norm(curr.values - contestant.values))})
    # update nearest row to current row and the distance value
    nearest_rows.append(max(e_dists, key=e_dists.get))
    nearest_distance.append(max(e_dists.values()))

df['nearest_row'] = nearest_rows
df['dist'] = nearest_distance
df

    p   q   r   s nearest_row        dist
a  92  73  10  24           c  119.795659
b  52  32  64   8           h   93.005376
c   9  46  92  21           a  119.795659
d  69  66  39  30           c   83.006024
e  25  17  78  30           a  110.837719
f  93  27  71  21           c   88.645361
g  74  95  69   9           j  105.664564
h  69  76  59  88           c  100.389242
i  55  54   8  38           c   97.596106
j  78  27  39  84           c  109.087121

    p   q   r   s nearest_row   dist
a  92  73  10  24           c  120.0
b  52  32  64   8           h   93.0
c   9  46  92  21           a  120.0
d  69  66  39  30           c   83.0
e  25  17  78  30           a  111.0
f  93  27  71  21           c   89.0
g  74  95  69   9           j  106.0
h  69  76  59  88           c  100.0
i  55  54   8  38           c   98.0
j  78  27  39  84           c  109.0


<a id = 'q61'></a>

**61. How to know the maximum possible correlation value of each column against other columns?**

For each column get the maximum possible correlation with other columns (only 1 value)

[Go back to the table of contents](#table_of_contents)

In [122]:
# input
df = pd.DataFrame(np.random.randint(1,100, 80).reshape(8, -1), columns=list('pqrstuvwxy'), index=list('abcdefgh'))

In [123]:

# calculate the correlation, returns a matrix 
df_corr = np.abs(df.corr())
# sorted -2 because it goes from min to max
# max = 1 because it's correlation againts each other
# so we pick -2
max_corr = df_corr.apply(lambda x: sorted(x)[-2], axis = 0)
max_corr

p    0.494520
q    0.665317
r    0.609711
s    0.633902
t    0.831735
u    0.548622
v    0.745477
w    0.831735
x    0.665317
y    0.745477
dtype: float64


<a id = 'q62'></a>

**62. How to create a column containing the minimum by maximum of each row?**

Compute the minimum-by-maximum for every row of df.

[Go back to the table of contents](#table_of_contents)

In [124]:
# input
df = pd.DataFrame(np.random.randint(1,100, 80).reshape(8, -1))
df1 = df.copy(deep = True)
df2 = df.copy(deep = True)

In [125]:
# Solution 1
df["min_by_max"] = (df.apply(min, axis = 1)/df.apply(max, axis = 1))
df

# Other solution from the webpage
# Solution 2
min_by_max = df1.apply(lambda x: np.min(x)/np.max(x), axis=1)
min_by_max
# Solution 3
min_by_max = np.min(df2, axis=1)/np.max(df2, axis=1)
min_by_max

    0   1   2   3   4   5   6   7   8   9  min_by_max
0  90  71  78  67  74  67  89   9  34  49    0.100000
1  15  70  54  56  70  27  32  80  29  75    0.187500
2  68  56  49  38  67  92  41  59  59  96    0.395833
3  68  16  94  22  74  95  73  14  19  78    0.147368
4  34  10  71  32  34  31  73  19  49  33    0.136986
5  41  46  72   6   5  76  87  64  54  76    0.057471
6  54   8   3  90  28   1  54  96  81  22    0.010417
7  57   5   2  67  53  17  89  24  14  21    0.022472

0    0.100000
1    0.187500
2    0.395833
3    0.147368
4    0.136986
5    0.057471
6    0.010417
7    0.022472
dtype: float64

0    0.100000
1    0.187500
2    0.395833
3    0.147368
4    0.136986
5    0.057471
6    0.010417
7    0.022472
dtype: float64


<a id = 'q63'></a>

**63. How to create a column that contains the penultimate value in each row?**

Create a new column 'penultimate' which has the second largest value of each row of df.

[Go back to the table of contents](#table_of_contents)

In [126]:
# input
df = pd.DataFrame(np.random.randint(1,100, 80).reshape(8, -1))

In [127]:
# Using lambda and numpy partition
df["penultimate"] = df.apply(lambda x: np.partition(x, -2)[-2], axis = 1)
df
df.drop("penultimate", inplace = True, axis = 1)

# Using lambda and python lists
df["penultimate"] = df.apply(lambda x: sorted(list(x))[-2], axis = 1)
df
df.drop("penultimate", inplace = True, axis = 1)

# Solution from the webpage
out = df.apply(lambda x: x.sort_values().unique()[-2], axis=1)
df['penultimate'] = out
df

    0   1   2   3   4   5   6   7   8   9  penultimate
0   7  85   5  33  29  87  22  34  47   5           85
1  38  28  96  12  90  94  87  24  39  59           94
2  38  99  40  78  96  20  54  83  97  75           97
3  36  65  42  20  63  75  21  52  84   6           75
4  21   3  58  58  81  27  44  35  81  99           81
5  52  75   7  95  74  96  95  38  67  19           95
6  24  96  89  74  11  56  33  82  84  57           89
7  40  77  52  99  99  77  83  72  52  89           99

    0   1   2   3   4   5   6   7   8   9  penultimate
0   7  85   5  33  29  87  22  34  47   5           85
1  38  28  96  12  90  94  87  24  39  59           94
2  38  99  40  78  96  20  54  83  97  75           97
3  36  65  42  20  63  75  21  52  84   6           75
4  21   3  58  58  81  27  44  35  81  99           81
5  52  75   7  95  74  96  95  38  67  19           95
6  24  96  89  74  11  56  33  82  84  57           89
7  40  77  52  99  99  77  83  72  52  89           99

    0   1   2   3   4   5   6   7   8   9  penultimate
0   7  85   5  33  29  87  22  34  47   5           85
1  38  28  96  12  90  94  87  24  39  59           94
2  38  99  40  78  96  20  54  83  97  75           97
3  36  65  42  20  63  75  21  52  84   6           75
4  21   3  58  58  81  27  44  35  81  99           81
5  52  75   7  95  74  96  95  38  67  19           95
6  24  96  89  74  11  56  33  82  84  57           89
7  40  77  52  99  99  77  83  72  52  89           89


<a id = 'q64'></a>

**64. How to normalize all columns in a dataframe?**

1. Normalize all columns of df by subtracting the column mean and divide by standard deviation.

2. Range all columns of df such that the minimum value in each column is 0 and max is 1.

**Don’t use external packages like sklearn**

[Go back to the table of contents](#table_of_contents)

In [128]:
# input
df = pd.DataFrame(np.random.randint(1,100, 80).reshape(8, -1))
df1 = df.copy(deep = True)

In [129]:
# First normalization: mean and std    
df = df.apply(lambda x: ((x-np.mean(x))/np.std(x)), axis = 0)
df

# min max
df1 = df1.apply(lambda x: ((x.max() - x)/(x.max() - x.min())).round(2))
df1

,0,1,2,3,4,5,6,7,8,9
0,0.409275,-0.904587,-1.521522,-1.496479,-1.065800,1.518110,-0.630528,-0.691101,-0.560790,1.487684
1,-0.323755,1.477110,-0.640981,1.707251,1.530716,-0.406489,-0.720604,0.432400,0.922874,-0.642409
2,0.897962,-0.309163,0.084169,0.442621,1.144748,-0.970595,1.486245,-1.400681,-1.196646,1.081952
3,0.213801,1.522912,0.757524,-0.779855,0.618427,0.323532,1.486245,1.053282,0.746248,1.081952
4,-1.545472,0.332063,-1.055353,0.400466,0.442987,-0.937412,0.405340,-1.548510,-1.196646,-0.101433
5,1.142306,0.057252,0.135966,0.400466,-0.960536,-1.136509,-0.540453,0.728058,-0.914043,-1.081952
6,-1.594341,-0.858785,1.845250,-1.201399,-0.504391,0.091253,0.000000,0.314137,0.816898,-1.217196
7,0.800225,-1.316803,0.394948,0.526929,-1.206152,1.518110,-1.486245,1.112414,1.382104,-0.608598

      0     1     2     3     4     5     6     7     8     9
0  0.27  0.85  1.00  1.00  0.95  0.00  0.71  0.68  0.75  0.00
1  0.54  0.02  0.74  0.00  0.00  0.72  0.74  0.26  0.18  0.79
2  0.09  0.65  0.52  0.39  0.14  0.94  0.00  0.94  1.00  0.15
3  0.34  0.00  0.32  0.78  0.33  0.45  0.00  0.02  0.25  0.15
4  0.98  0.42  0.86  0.41  0.40  0.92  0.36  1.00  1.00  0.59
5  0.00  0.52  0.51  0.41  0.91  1.00  0.68  0.14  0.89  0.95
6  1.00  0.84  0.00  0.91  0.74  0.54  0.50  0.30  0.22  1.00
7  0.12  1.00  0.43  0.37  1.00  0.00  1.00  0.00  0.00  0.78


<a id = 'q65'></a>

**65. How to compute the correlation of each row with the suceeding row?**

Compute the correlation of each row of df with its succeeding row.

[Go back to the table of contents](#table_of_contents)

In [130]:
# input
df = pd.DataFrame(np.random.randint(1,100, 80).reshape(8, -1))

In [131]:
df["corr"] = 0
for i in range(len(df)-1):
    
    values1 = df.iloc[i, :-1].astype('float64')
    values2 = df.iloc[i+1, :-1].astype('float64')
    corr = values1.corr(values2)
    df["corr"].iloc[i] = corr
df
df.drop("corr", inplace = True, axis = 1)

# Solution from the webpage
# using list comprehension
[df.iloc[i].corr(df.iloc[i+1]).round(2) for i in range(df.shape[0])[:-1]]

    0   1   2   3   4   5   6   7   8   9      corr
0  31  41  94  79  85  90   8  18  36  52 -0.379046
1  83  34  77  60  71  28  86  82  62  41 -0.184422
2  48  85  32  54  38  73  33  77  98   1 -0.304875
3   8   7  46  59  29  58  61  27  78  93 -0.103117
4  21  75  32  59  62  51  61  52  57  32  0.234982
5  18  42  10  97   3  61  88  16  17  64  0.545806
6  26  37  38  96  17  27  77  80  76  80  0.010480
7  29   5  81   3  42  22   8  94   9  77  0.000000

[-0.38, -0.18, -0.3, -0.1, 0.23, 0.55, 0.01]


<a id = 'q66'></a>

**66. How to replace both the diagonals of dataframe with 0?**

Replace both values in both diagonals of df with 0.

[Go back to the table of contents](#table_of_contents)

In [132]:
# input
df = pd.DataFrame(np.random.randint(1,100, 100).reshape(10, -1))
df1 = df.copy(deep = True)

'''
Desired Output (might change because of randomness)

#     0   1   2   3   4   5   6   7   8   9
# 0   0  46  26  44  11  62  18  70  68   0
# 1  87   0  52  50  81  43  83  39   0  59
# 2  47  76   0  77  73   2   2   0  14  26
# 3  64  18  74   0  16  37   0   8  66  39
# 4  10  18  39  98   0   0  32   6   3  29
# 5  29  91  27  86   0   0  28  31  97  10
# 6  37  71  70   0   4  72   0  89  12  97
# 7  65  22   0  75  17  10  43   0  12  77
# 8  47   0  96  55  17  83  61  85   0  86
# 9   0  80  28  45  77  12  67  80   7   0
'''

'\nDesired Output (might change because of randomness)\n\n#     0   1   2   3   4   5   6   7   8   9\n# 0   0  46  26  44  11  62  18  70  68   0\n# 1  87   0  52  50  81  43  83  39   0  59\n# 2  47  76   0  77  73   2   2   0  14  26\n# 3  64  18  74   0  16  37   0   8  66  39\n# 4  10  18  39  98   0   0  32   6   3  29\n# 5  29  91  27  86   0   0  28  31  97  10\n# 6  37  71  70   0   4  72   0  89  12  97\n# 7  65  22   0  75  17  10  43   0  12  77\n# 8  47   0  96  55  17  83  61  85   0  86\n# 9   0  80  28  45  77  12  67  80   7   0\n'

In [133]:
# input
df = pd.DataFrame(np.random.randint(1,100, 100).reshape(10, -1))
df1 = df.copy(deep = True)

# Using nested loops
print("Original DF")
df
for i in range(len(df)):
    for j in range(len(df)):
        if i == j:
            df.iloc[i ,j] = 0
            # Inverse the matrix so that we can replace the other diagonal
            df[::-1].iloc[i, j] = 0

print("DF from the solution 1")
df

# Solution from the webpage
# Solution
for i in range(df1.shape[0]):
    df1.iat[i, i] = 0
    df1.iat[df1.shape[0]-i-1, i] = 0
    
print("DF from the solution 2")
df1

Original DF

    0   1   2   3   4   5   6   7   8   9
0   1  46  24  14   3  14  53  73  65  40
1  81  76  33  52  58  23  11  98  94   4
2  56  31  85  34  67  25  27  84  21  71
3  67  38  37  46  37  93  28  78  76  58
4  12  15   9  48  56  95  33  80  77  46
5  77  96  96  49  98  80  56   5  79  92
6   7  71  47  56  44  39  88  72  33  60
7  30  82  24  10   5  67  15  77  37  24
8  74  47  88  60  66  37  64  18  44  70
9  81  62  37  81  62  20  89  68  48  11

DF from the solution 1

    0   1   2   3   4   5   6   7   8   9
0   0  46  24  14   3  14  53  73  65   0
1  81   0  33  52  58  23  11  98   0   4
2  56  31   0  34  67  25  27   0  21  71
3  67  38  37   0  37  93   0  78  76  58
4  12  15   9  48   0   0  33  80  77  46
5  77  96  96  49   0   0  56   5  79  92
6   7  71  47   0  44  39   0  72  33  60
7  30  82   0  10   5  67  15   0  37  24
8  74   0  88  60  66  37  64  18   0  70
9   0  62  37  81  62  20  89  68  48   0

DF from the solution 2

    0   1   2   3   4   5   6   7   8   9
0   0  46  24  14   3  14  53  73  65   0
1  81   0  33  52  58  23  11  98   0   4
2  56  31   0  34  67  25  27   0  21  71
3  67  38  37   0  37  93   0  78  76  58
4  12  15   9  48   0   0  33  80  77  46
5  77  96  96  49   0   0  56   5  79  92
6   7  71  47   0  44  39   0  72  33  60
7  30  82   0  10   5  67  15   0  37  24
8  74   0  88  60  66  37  64  18   0  70
9   0  62  37  81  62  20  89  68  48   0

<a id = 'q67'></a>

**67. How to get the particular group of a groupby dataframe by key?**

This is a question related to understanding of grouped dataframe. From df_grouped, get the group belonging to 'apple' as a dataframe.

[Go back to the table of contents](#table_of_contents)

In [134]:
# input
df = pd.DataFrame({'col1': ['apple', 'banana', 'orange'] * 3,
                   'col2': np.random.rand(9),
                   'col3': np.random.randint(0, 15, 9)})

df_grouped = df.groupby(['col1'])

In [135]:
# Solution 1
pd.DataFrame(df_grouped)
df_grouped.groups["apple"]
df_grouped.get_group("apple")

# Solution 2
for i, dff in df_grouped:
    if i == 'apple':
        print(dff)

        0                                                  1
0   apple      col1      col2  col3
0  apple  0.528923   ...
1  banana       col1      col2  col3
1  banana  0.229905 ...
2  orange       col1      col2  col3
2  orange  0.702951 ...

Int64Index([0, 3, 6], dtype='int64')

    col1      col2  col3
0  apple  0.528923     7
3  apple  0.963612     6
6  apple  0.826315     7

    col1      col2  col3
0  apple  0.528923     7
3  apple  0.963612     6
6  apple  0.826315     7

<a id = 'q68'></a>

**68. How to get the n’th largest value of a column when grouped by another column?**

In df, find the second largest value of 'rating' for 'banana'

[Go back to the table of contents](#table_of_contents)

In [136]:
# input
df = pd.DataFrame({'fruit': ['apple', 'banana', 'orange'] * 3,
                   'rating': np.random.rand(9),
                   'price': np.random.randint(0, 15, 9)})

In [137]:
# Solution 1
grouped_by = df["rating"].groupby(df["fruit"])
grouped_by.get_group("banana")
list(grouped_by.get_group("banana"))[1]

# Solution from the webpage
df_grpd = df['rating'].groupby(df.fruit)
df_grpd.get_group('banana')
df_grpd.get_group('banana').sort_values().iloc[-2]

1    0.996525
4    0.446977
7    0.417609
Name: rating, dtype: float64

0.44697696572578804

1    0.996525
4    0.446977
7    0.417609
Name: rating, dtype: float64

0.44697696572578804

<a id = 'q69'></a>

**69. How to compute grouped mean on pandas dataframe and keep the grouped column as another column (not index)?**

In df, Compute the mean price of every fruit, while keeping the fruit as another column instead of an index.

[Go back to the table of contents](#table_of_contents)

In [138]:
# input
df = pd.DataFrame({'fruit': ['apple', 'banana', 'orange'] * 3,
                   'rating': np.random.rand(9),
                   'price': np.random.randint(0, 15, 9)})
df

    fruit    rating  price
0   apple  0.554315      2
1  banana  0.138320      0
2  orange  0.310696      2
3   apple  0.081166     11
4  banana  0.916956      7
5  orange  0.643483      3
6   apple  0.116001      0
7  banana  0.091210      6
8  orange  0.959971     12

In [139]:
# Using pandas pivot table
df_grouped = pd.pivot_table(df[["fruit", "price"]], index = ["fruit"], aggfunc = np.mean ).reset_index()
df_grouped

# using groupby
out = df.groupby('fruit', as_index=False)['price'].mean()
out

    fruit     price
0   apple  4.333333
1  banana  4.333333
2  orange  5.666667

    fruit     price
0   apple  4.333333
1  banana  4.333333
2  orange  5.666667

<a id = 'q70'></a>

**70. How to join two dataframes by 2 columns so they have only the common rows?**

Join dataframes df1 and df2 by ‘fruit-pazham’ and ‘weight-kilo’.

[Go back to the table of contents](#table_of_contents)

In [140]:
# input
df1 = pd.DataFrame({'fruit': ['apple', 'banana', 'orange'] * 3,
                    'weight': ['high', 'medium', 'low'] * 3,
                    'price': np.random.randint(0, 15, 9)})

df2 = pd.DataFrame({'pazham': ['apple', 'orange', 'pine'] * 2,
                    'kilo': ['high', 'low'] * 3,
                    'price': np.random.randint(0, 15, 6)})
df1
df2

    fruit  weight  price
0   apple    high     12
1  banana  medium      1
2  orange     low     10
3   apple    high      2
4  banana  medium     12
5  orange     low     10
6   apple    high      0
7  banana  medium      6
8  orange     low     11

   pazham  kilo  price
0   apple  high      0
1  orange   low      1
2    pine  high      7
3   apple   low     13
4  orange  high      0
5    pine   low      0

In [141]:
# Solution 1
# using pandas merge
merge_df = pd.merge(df1, df2, left_on=["fruit", "weight"], right_on=["pazham", "kilo"])
merge_df


# Solution from the webpage
pd.merge(df1, df2, how='inner', left_on=['fruit', 'weight'], right_on=['pazham', 'kilo'], suffixes=['_left', '_right'])

    fruit weight  price_x  pazham  kilo  price_y
0   apple   high       12   apple  high        0
1   apple   high        2   apple  high        0
2   apple   high        0   apple  high        0
3  orange    low       10  orange   low        1
4  orange    low       10  orange   low        1
5  orange    low       11  orange   low        1

    fruit weight  price_left  pazham  kilo  price_right
0   apple   high          12   apple  high            0
1   apple   high           2   apple  high            0
2   apple   high           0   apple  high            0
3  orange    low          10  orange   low            1
4  orange    low          10  orange   low            1
5  orange    low          11  orange   low            1

<a id = 'q71'></a>

**71. How to remove rows from a dataframe that are present in another dataframe?**

From df1, remove the rows that are present in df2. All three columns must be the same.

[Go back to the table of contents](#table_of_contents)

In [142]:
# input
df1 = pd.DataFrame({'fruit': ['apple', 'banana', 'orange'] * 3,
                    'weight': ['high', 'medium', 'low'] * 3,
                    'price': np.random.randint(0, 10, 9)})

df2 = pd.DataFrame({'pazham': ['apple', 'orange', 'pine'] * 2,
                    'kilo': ['high', 'low'] * 3,
                    'price': np.random.randint(0, 10, 6)})

df1
df2

    fruit  weight  price
0   apple    high      6
1  banana  medium      6
2  orange     low      0
3   apple    high      5
4  banana  medium      2
5  orange     low      4
6   apple    high      1
7  banana  medium      4
8  orange     low      9

   pazham  kilo  price
0   apple  high      6
1  orange   low      0
2    pine  high      0
3   apple   low      8
4  orange  high      3
5    pine   low      1

In [143]:
# We might use pandas merge
#df1.merge(df2, how = "inner", left_on = ["fruit", "weight", "price"], right_on = ["pazham", "kilo", "price"])

df1["concat"] = df1["fruit"].astype(str) + df1["weight"].astype(str) + df1["price"].astype(str)
#df1

df2["concat"] = df2["pazham"].astype(str) + df2["kilo"].astype(str) + df2["price"].astype(str)
#df2

df1 = df1[~df1["concat"].isin(df2["concat"])]
df1.drop("concat", inplace = True, axis = 1)
df1

# Solution from the webpage, IMHO it's incorrect
#df1[~df1.isin(df2).all(1)]

/opt/conda/lib/python3.6/site-packages/pandas/core/frame.py:4117: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

    fruit  weight  price
1  banana  medium      6
3   apple    high      5
4  banana  medium      2
5  orange     low      4
6   apple    high      1
7  banana  medium      4
8  orange     low      9

<a id = 'q72'></a>

**72. How to get the positions where values of two columns match?**

Find the index where col fruit1 and fruit2 match

[Go back to the table of contents](#table_of_contents)

In [144]:
# input
df = pd.DataFrame({'fruit1': np.random.choice(['apple', 'orange', 'banana'], 10),
                    'fruit2': np.random.choice(['apple', 'orange', 'banana'], 10)})
df

   fruit1  fruit2
0  orange  orange
1   apple  orange
2  banana  banana
3  orange  orange
4  banana  orange
5   apple  orange
6  banana  orange
7   apple  banana
8  banana  banana
9   apple  banana

In [145]:
# Solution
np.where(df.fruit1 == df.fruit2)

(array([0, 2, 3, 8]),)

<a id = 'q73'></a>

**73. How to create lags and leads of a column in a dataframe?**

Create two new columns in df, one of which is a lag1 (shift column a down by 1 row) of column ‘a’ and the other is a lead1 (shift column b up by 1 row).

[Go back to the table of contents](#table_of_contents)

In [146]:
# input
df = pd.DataFrame(np.random.randint(1, 100, 20).reshape(-1, 4), columns = list('abcd'))
df

'''
Desired Output

    a   b   c   d  a_lag1  b_lead1
0  66  34  76  47     NaN     86.0
1  20  86  10  81    66.0     73.0
2  75  73  51  28    20.0      1.0
3   1   1   9  83    75.0     47.0
4  30  47  67   4     1.0      NaN
'''

    a   b   c   d
0  56  65  18  54
1  90  90  11  32
2  30  61   2  47
3   8   6  49  44
4  50  67  22  69

'\nDesired Output\n\n    a   b   c   d  a_lag1  b_lead1\n0  66  34  76  47     NaN     86.0\n1  20  86  10  81    66.0     73.0\n2  75  73  51  28    20.0      1.0\n3   1   1   9  83    75.0     47.0\n4  30  47  67   4     1.0      NaN\n'

In [147]:
df["lag1"] = df["a"].shift(1)
df["lead1"] = df["b"].shift(-1)
df

    a   b   c   d  lag1  lead1
0  56  65  18  54   NaN   90.0
1  90  90  11  32  56.0   61.0
2  30  61   2  47  90.0    6.0
3   8   6  49  44  30.0   67.0
4  50  67  22  69   8.0    NaN

<a id = 'q74'></a>

**74. How to get the frequency of unique values in the entire dataframe?**

Get the frequency of unique values in the entire dataframe df.

[Go back to the table of contents](#table_of_contents)

In [148]:
# input
df = pd.DataFrame(np.random.randint(1, 10, 20).reshape(-1, 4), columns = list('abcd'))

In [149]:
# Solution
pd.value_counts(df.values.ravel())

3    5
8    3
1    3
9    2
7    2
6    2
2    2
4    1
dtype: int64

<a id = 'q75'></a>

**75. How to split a text column into two separate columns?**

Split the string column in df to form a dataframe with 3 columns as shown.

[Go back to the table of contents](#table_of_contents)

In [150]:
# input
df = pd.DataFrame(["STD, City    State",
"33, Kolkata    West Bengal",
"44, Chennai    Tamil Nadu",
"40, Hyderabad    Telengana",
"80, Bangalore    Karnataka"], columns=['row'])

df

'''
Desired Output

0 STD        City        State
1  33     Kolkata  West Bengal
2  44     Chennai   Tamil Nadu
3  40   Hyderabad    Telengana
4  80   Bangalore    Karnataka
'''

                          row
0          STD, City    State
1  33, Kolkata    West Bengal
2   44, Chennai    Tamil Nadu
3  40, Hyderabad    Telengana
4  80, Bangalore    Karnataka

'\nDesired Output\n\n0 STD        City        State\n1  33     Kolkata  West Bengal\n2  44     Chennai   Tamil Nadu\n3  40   Hyderabad    Telengana\n4  80   Bangalore    Karnataka\n'

In [151]:
# we do " ".join(x.split()) to replace multiple spaces to 1 space
# we do split(None, 2, ) to split a string on the second space ()this way we have West Bengal together
df["re"] = df["row"].apply(lambda x: " ".join(x.split()).split(None, 2, ))

new_header = df["re"][0]
values = df["re"][1:]

# our values is a series of lists, we have to do some list comprehension no extract the values
d = {new_header[0]:[int(values.iloc[i][0].replace(",", "")) for i in range(len(values))], \
     new_header[1]:[values.iloc[i][1].replace(",", "") for i in range(len(values))], \
     new_header[2]:[values.iloc[i][2].replace(",", "") for i in range(len(values))]}

# create a pandas DF from a dict
new_df = pd.DataFrame(d)
new_df

   STD,       City        State
0    33    Kolkata  West Bengal
1    44    Chennai   Tamil Nadu
2    40  Hyderabad    Telengana
3    80  Bangalore    Karnataka

# The End
# Thank you very much!